{
    "status": "ok",
    "feed": {
        "url": "https://medium.com/feed/@tylercitrin",
        "title": "Stories by Tyler Citrin on Medium",
        "link": "https://medium.com/@tylercitrin?source=rss-28ed505e83f3------2",
        "author": "",
        "description": "Stories by Tyler Citrin on Medium",
        "image": "https://cdn-images-1.medium.com/fit/c/150/150/1*ZX1x1wCSM9W8KbomQJLR9Q.jpeg"
    },
    "items": [
        {
            "title": "6 — Golf and Caddying Part 2: On The Four-Hour Career and a Lifelong Work-Ethic",
            "pubDate": "2018-02-20 14:48:59",
            "link": "https://medium.com/@tylercitrin/6-golf-and-caddying-part-2-on-the-four-hour-career-and-a-lifelong-work-ethic-da6c11ab4c1c?source=rss-28ed505e83f3------2",
            "guid": "https://medium.com/p/da6c11ab4c1c",
            "author": "Tyler Citrin",
            "thumbnail": "https://cdn-images-1.medium.com/max/630/1*6SSuDC_A7NlHlpbMQp1vaQ.jpeg",
            "description": "\n<h3>6 — Golf and Caddying Part 2: On The Four-Hour Career and a Lifelong Work-Ethic</h3>\n<p><strong><em>preface: </em></strong><em>Given the nature of this series, spanning the last 11 years of my life (chronologically), I will be writing each story in first-person as if I was writing at that age.</em></p>\n<p><strong>ages:</strong> 14–18</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/630/1*6SSuDC_A7NlHlpbMQp1vaQ.jpeg\"></figure><p>Not everyone follows golf, and far fewer people know what caddying is or entails. For the latter, the common notion is that “all we do is carry clubs…” likening the occupation to that of a pack-mule. Yes, there is no denying we carry clubs, it is certainly a component of the job, and even though that is among the first duties listed in the job description, there is far more required than you could imagine.</p>\n<p>In the previous article I talked about when I started caddying and eventually was given my first round of work, however, I didn’t talk about what the process looked like. When I asked Alex, my friend who got me the job, what time I should be there, he defaulted to his father who knew what he knew from observations: “the earlier, the better.”</p>\n<p>At the time I didn’t have a car and my parents weren’t able to get me there at the time needed, so I needed an alternative way to arrive before the sun rise. Now you may wonder if there is any correlation between when you arrive, how high up you are on the sign-in sheet, and when you get a job for the day; there is not, however, when I first started I had no reason to believe otherwise.</p>\n<p>Once I began I quickly befriended another caddie named Gabe. Gabe was a giant teddy bear and truly one of the most polite and and giving caddies I ever met. Gabe took care of me, and this started off by him picking me up every day at 5 am. Yes, we would get up at 5, or rather he was often at my house at 5, then we would go, sign in, and sleep. Sometimes it was the car, other times it was in the caddy shack, and occasionally if we knew it was going to be a slow day, we would go back to his house and just crash on the couch for an hour or two.</p>\n<p>For about two weeks I did this before I got a round. To put it into perspective, it was six days a week, for two weeks, from 5 am, to somewhere in the window of 3–5 pm. When I left was only determined by when I could get a ride home, when I was told the work day was over, or when I was told they forgot I was still there, which was the absolute worst. I had a tally for the hours each day, and if my math is correct I approached 150 hours in the time period of <em>just waiting.</em></p>\n<p>I ask you stop for a second and think about the last time you were able to quantify a commit of that magnitude, and then try to justify achieving that level in that short time span; can you fathom the lack of worth and motivation someone might feel after a period like that?</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*PpSoGUlOapZXUuyyoi6tcQ.jpeg\"></figure><p>To keep it simple, it wasn’t easy. The first few days were okay, the next few days I started getting irritated, and then for the days that followed I questioned whether or not I would ever get a shot. I’ll never know why it took so long for me to get out, but in those two weeks alone I gained a lot. I acquired a bunch of new friends in the workplace where I would remain for the next few years and I learned about radically different people and their life stories. I became quite skilled in chess and spades, and mastered the rubik’s cube with other cool tricks I picked up along the way.</p>\n<p>I learned about the working life and the struggle of day-to-day not knowing what tomorrow holds, I learned about what it’s like to work to support yourself and your family, I learned about pure professionalism in a service industry, I learned about learning on the job, but most importantly I learned about myself. I’ll try to break these into more detail to paint a picture of what it’s like to be a caddy.</p>\n<p><strong>Day-to-day</strong></p>\n<p>Let’s draw a comparison to start. The salaried worker has the freedom of having an “off-day,” maybe coming in a little late or leaving a little early from time to time. Yes, he too has objectives and milestones he has to hit, but the thought of not being able to make up for it the next day or whether there even is a next day is absent from his mind.</p>\n<p>In the life of a caddie, every day is full of surprises. Each round his reputation is on the line, and it can get better of course, but there are a hundred other caddies ready to take his spot. No matter how good a caddie is, the golfer has all the say and dictates his pay as well as your reputation. When the golfer has an off day, it’s the caddie’s fault, but when the golfer has a good day, it’s because of the golfer… so basically, the caddie is always wrong.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*ttK4AFEAfHdFpRLPrOK8Ng.jpeg\"></figure><p><strong>Support</strong></p>\n<p>As a caddie one has the opportunity to make good money, if he or she puts the time in. But with the above, there are many other variables often out of a caddie’s control. It’s also just not easy, waking up at the crack of dawn, spending all day in the heat, traversing a sometimes never ending maze of trails, all to just to get ready to do it again.</p>\n<p>It is definitely manual labor and you definitely have to be in physical shape, but that’s not the only type of shape it requires. It builds character and really does a lot to a person psychologically. On one end you could be in a drought like me, sitting and waiting and not making money, if I hadn’t made it clear before, and on the other end you could walk the same course with the same path at the same time every single day. You almost become numb to it, kind of like when you’re tired driving home and when you arrive you realize you don’t remember the ride. Now picture that happening every day.</p>\n<p>It’s like the saying, “it doesn’t get any easier, you just get stronger,” but this has to be indefinite. When you’re working for a greater cause, for me it was to pay for college, I yearned for a breath of fresh air or some reminder that I could and would get through it, not because I wanted to, but simply because I had too.</p>\n<p><strong>Professionalism</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/480/1*J2ginCT6AdOB5-ZQm5k8JA.jpeg\"></figure><p>When you’re out there on the course, or anywhere in the facility, essentially as soon as you come through that gate you enter another realm. Where you park, what you drive, how you walk, how you dress and bathe, everything matters. The golfers, you’d like to think are all well-mannered and kind, and treat you the way they would their colleagues. This is certainly not the case.</p>\n<p>Caddying is like a box of chocolates, you never know how kind or cruel the golfer will be, or some saying like that. Every day there are new people who bring new challenges, but you always have the same rules and responsibilities. No matter what, the caddie has to treat the golfers with utmost respect and put his own thoughts and opinions aside. For example, you speak when spoken too, but never assert a differing opinion</p>\n<p><strong>Learning on the Job</strong></p>\n<p>Let’s get into the nitty gritty. Caddying is not easy, and there’s no “Caddying for Dummies” that could do justice for what it takes. You can read, research, watch videos all you want, but you can only learn by doing. The ‘chicken and the egg’ really kills here because you can only get better with practice, but you only get work when you build up a reputation of doing well after your practice, so wrap your head around that one.</p>\n<p>As for the specifics, caddies are “the single source of truth” (for my computer science friends out there), which means they have to know everything that could be possibly known at all times as well as accomplish tasks simultaneously, along with managing many moving parts. If that wasn’t hard to follow as intended, i’ll give you a few examples, and bear in mind for some of the metrics, these criteria are scaled by the amount of golfers someone is caddying for which is often two, but can be up to four. So, as the caddy you:</p>\n<ul>\n<li>are always close enough to the golfer to talk but far enough to keep pace</li>\n<li>are always two steps ahead of the golfer but never three</li>\n<li>know how far you’ve walked</li>\n<li>know how far you have left</li>\n<li>know the speed and direction of the wind</li>\n<li>memorize the length of 36 holes</li>\n<li>memorize the map of the 36 holes</li>\n<li>memorize the distances to all the features of the 36 holes</li>\n<li>know where other golfers are hitting to protect yourself</li>\n<li>know where other golfers are hitting to protect your golfers</li>\n<li>can estimate how far the golfer will hit to get ahead and be ready, but still never be too far</li>\n<li>can carry two golf bags with a combined weight of near 100 pounds</li>\n<li>carry those bags for <strong>4 hours in the sun</strong>\n</li>\n<li>keep track of 14 and potentially 28 clubs</li>\n<li>know which club belongs in which bag and to whom</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/630/1*JdxzEVC0OF2sCp4mfBRH1A.jpeg\"><figcaption>what caddying looks like</figcaption></figure><ul>\n<li>know the number and type of ball each golfer is using</li>\n<li>memorize every green (<em>where you putt and where the hole is)</em>\n</li>\n<li>can read every green (<em>where and how fast the ball will roll)</em>\n</li>\n<li>can read every green from every angle</li>\n<li>know the slope and the grain of green <em>(which way the grass grows)</em>\n</li>\n<li>know how fast the golfer can put the ball</li>\n<li>know how fast the golfer <em>should </em>put the ball</li>\n<li>know which club to suggest for each distance</li>\n<li>know which club to suggest for each lie <em>(how the ball landed i.e. is laying on the ground)</em>\n</li>\n<li>know which club to suggest for each distance and each lie</li>\n<li>know physics to combine all the above</li>\n<li>are really good at physics to be really good at combining all the above</li>\n<li>have <em>only </em>four pockets but somehow hold extra balls, gloves, head covers, water bottles, scorecards, tees, a book, a laser, a towel, some snacks, a divot-tool, more water, and finally your dignity,</li>\n<li>last but not least, <strong>never</strong> lose site of a small white ball sometimes traveling over 130 mph a few hundred yards away that doesn’t make a sound and passes you in the blink of an eye which you are forced to do voluntarily because you look up into the sun to gauge the trajectory but have to blink fast enough and wipe away the tears of staring at the sun to ensure that the ball does not get lost</li>\n<li>do the above 17 more times, multiplied by each golfer, even if they’re not your own</li>\n</ul>\n<p>Caddying is hard, caddying is fun, but caddying is not easy, if the in-comprehensive and non-exhaustive previous list of tasks weren’t enough to clarify.</p>\n<p><strong>Me, Myself, and I</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/475/1*KQoKK4t_Lkl3P3N2dLKtqQ.png\"></figure><p>When you have all that time, you think a lot. Personally, I wrote random pieces, came up with random algorithms, and essentially tried to latch onto every side gig other caddies offered in search of another income stream.</p>\n<p>I learned how my brain worked, how I thought, how I organized my thoughts. I learned about what my goals in life were, what and where my purpose derived from. I learned about all the different forms of potential I had. I developed a strong work-ethic that I would never lose and a sphere of resilience. I became tough and patient. I became versatile and adaptive due to my role and responsibilities as a caddie.</p>\n<p>Caddying really put a lot of hair on my chest. Not literally (at least not directly intended as such), but I really came into my character. Every summer I aged a few extra months both through experience and maturity. I kept the wisdom I received and discovered a lot on my own. I can’t say I loved it, and I won’t say I never hated it, but I can honestly say I wouldn’t be the same person I am today if it wasn’t for my job as a caddie.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=da6c11ab4c1c\" width=\"1\" height=\"1\">\n",
            "content": "\n<h3>6 — Golf and Caddying Part 2: On The Four-Hour Career and a Lifelong Work-Ethic</h3>\n<p><strong><em>preface: </em></strong><em>Given the nature of this series, spanning the last 11 years of my life (chronologically), I will be writing each story in first-person as if I was writing at that age.</em></p>\n<p><strong>ages:</strong> 14–18</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/630/1*6SSuDC_A7NlHlpbMQp1vaQ.jpeg\"></figure><p>Not everyone follows golf, and far fewer people know what caddying is or entails. For the latter, the common notion is that “all we do is carry clubs…” likening the occupation to that of a pack-mule. Yes, there is no denying we carry clubs, it is certainly a component of the job, and even though that is among the first duties listed in the job description, there is far more required than you could imagine.</p>\n<p>In the previous article I talked about when I started caddying and eventually was given my first round of work, however, I didn’t talk about what the process looked like. When I asked Alex, my friend who got me the job, what time I should be there, he defaulted to his father who knew what he knew from observations: “the earlier, the better.”</p>\n<p>At the time I didn’t have a car and my parents weren’t able to get me there at the time needed, so I needed an alternative way to arrive before the sun rise. Now you may wonder if there is any correlation between when you arrive, how high up you are on the sign-in sheet, and when you get a job for the day; there is not, however, when I first started I had no reason to believe otherwise.</p>\n<p>Once I began I quickly befriended another caddie named Gabe. Gabe was a giant teddy bear and truly one of the most polite and and giving caddies I ever met. Gabe took care of me, and this started off by him picking me up every day at 5 am. Yes, we would get up at 5, or rather he was often at my house at 5, then we would go, sign in, and sleep. Sometimes it was the car, other times it was in the caddy shack, and occasionally if we knew it was going to be a slow day, we would go back to his house and just crash on the couch for an hour or two.</p>\n<p>For about two weeks I did this before I got a round. To put it into perspective, it was six days a week, for two weeks, from 5 am, to somewhere in the window of 3–5 pm. When I left was only determined by when I could get a ride home, when I was told the work day was over, or when I was told they forgot I was still there, which was the absolute worst. I had a tally for the hours each day, and if my math is correct I approached 150 hours in the time period of <em>just waiting.</em></p>\n<p>I ask you stop for a second and think about the last time you were able to quantify a commit of that magnitude, and then try to justify achieving that level in that short time span; can you fathom the lack of worth and motivation someone might feel after a period like that?</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*PpSoGUlOapZXUuyyoi6tcQ.jpeg\"></figure><p>To keep it simple, it wasn’t easy. The first few days were okay, the next few days I started getting irritated, and then for the days that followed I questioned whether or not I would ever get a shot. I’ll never know why it took so long for me to get out, but in those two weeks alone I gained a lot. I acquired a bunch of new friends in the workplace where I would remain for the next few years and I learned about radically different people and their life stories. I became quite skilled in chess and spades, and mastered the rubik’s cube with other cool tricks I picked up along the way.</p>\n<p>I learned about the working life and the struggle of day-to-day not knowing what tomorrow holds, I learned about what it’s like to work to support yourself and your family, I learned about pure professionalism in a service industry, I learned about learning on the job, but most importantly I learned about myself. I’ll try to break these into more detail to paint a picture of what it’s like to be a caddy.</p>\n<p><strong>Day-to-day</strong></p>\n<p>Let’s draw a comparison to start. The salaried worker has the freedom of having an “off-day,” maybe coming in a little late or leaving a little early from time to time. Yes, he too has objectives and milestones he has to hit, but the thought of not being able to make up for it the next day or whether there even is a next day is absent from his mind.</p>\n<p>In the life of a caddie, every day is full of surprises. Each round his reputation is on the line, and it can get better of course, but there are a hundred other caddies ready to take his spot. No matter how good a caddie is, the golfer has all the say and dictates his pay as well as your reputation. When the golfer has an off day, it’s the caddie’s fault, but when the golfer has a good day, it’s because of the golfer… so basically, the caddie is always wrong.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*ttK4AFEAfHdFpRLPrOK8Ng.jpeg\"></figure><p><strong>Support</strong></p>\n<p>As a caddie one has the opportunity to make good money, if he or she puts the time in. But with the above, there are many other variables often out of a caddie’s control. It’s also just not easy, waking up at the crack of dawn, spending all day in the heat, traversing a sometimes never ending maze of trails, all to just to get ready to do it again.</p>\n<p>It is definitely manual labor and you definitely have to be in physical shape, but that’s not the only type of shape it requires. It builds character and really does a lot to a person psychologically. On one end you could be in a drought like me, sitting and waiting and not making money, if I hadn’t made it clear before, and on the other end you could walk the same course with the same path at the same time every single day. You almost become numb to it, kind of like when you’re tired driving home and when you arrive you realize you don’t remember the ride. Now picture that happening every day.</p>\n<p>It’s like the saying, “it doesn’t get any easier, you just get stronger,” but this has to be indefinite. When you’re working for a greater cause, for me it was to pay for college, I yearned for a breath of fresh air or some reminder that I could and would get through it, not because I wanted to, but simply because I had too.</p>\n<p><strong>Professionalism</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/480/1*J2ginCT6AdOB5-ZQm5k8JA.jpeg\"></figure><p>When you’re out there on the course, or anywhere in the facility, essentially as soon as you come through that gate you enter another realm. Where you park, what you drive, how you walk, how you dress and bathe, everything matters. The golfers, you’d like to think are all well-mannered and kind, and treat you the way they would their colleagues. This is certainly not the case.</p>\n<p>Caddying is like a box of chocolates, you never know how kind or cruel the golfer will be, or some saying like that. Every day there are new people who bring new challenges, but you always have the same rules and responsibilities. No matter what, the caddie has to treat the golfers with utmost respect and put his own thoughts and opinions aside. For example, you speak when spoken too, but never assert a differing opinion</p>\n<p><strong>Learning on the Job</strong></p>\n<p>Let’s get into the nitty gritty. Caddying is not easy, and there’s no “Caddying for Dummies” that could do justice for what it takes. You can read, research, watch videos all you want, but you can only learn by doing. The ‘chicken and the egg’ really kills here because you can only get better with practice, but you only get work when you build up a reputation of doing well after your practice, so wrap your head around that one.</p>\n<p>As for the specifics, caddies are “the single source of truth” (for my computer science friends out there), which means they have to know everything that could be possibly known at all times as well as accomplish tasks simultaneously, along with managing many moving parts. If that wasn’t hard to follow as intended, i’ll give you a few examples, and bear in mind for some of the metrics, these criteria are scaled by the amount of golfers someone is caddying for which is often two, but can be up to four. So, as the caddy you:</p>\n<ul>\n<li>are always close enough to the golfer to talk but far enough to keep pace</li>\n<li>are always two steps ahead of the golfer but never three</li>\n<li>know how far you’ve walked</li>\n<li>know how far you have left</li>\n<li>know the speed and direction of the wind</li>\n<li>memorize the length of 36 holes</li>\n<li>memorize the map of the 36 holes</li>\n<li>memorize the distances to all the features of the 36 holes</li>\n<li>know where other golfers are hitting to protect yourself</li>\n<li>know where other golfers are hitting to protect your golfers</li>\n<li>can estimate how far the golfer will hit to get ahead and be ready, but still never be too far</li>\n<li>can carry two golf bags with a combined weight of near 100 pounds</li>\n<li>carry those bags for <strong>4 hours in the sun</strong>\n</li>\n<li>keep track of 14 and potentially 28 clubs</li>\n<li>know which club belongs in which bag and to whom</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/630/1*JdxzEVC0OF2sCp4mfBRH1A.jpeg\"><figcaption>what caddying looks like</figcaption></figure><ul>\n<li>know the number and type of ball each golfer is using</li>\n<li>memorize every green (<em>where you putt and where the hole is)</em>\n</li>\n<li>can read every green (<em>where and how fast the ball will roll)</em>\n</li>\n<li>can read every green from every angle</li>\n<li>know the slope and the grain of green <em>(which way the grass grows)</em>\n</li>\n<li>know how fast the golfer can put the ball</li>\n<li>know how fast the golfer <em>should </em>put the ball</li>\n<li>know which club to suggest for each distance</li>\n<li>know which club to suggest for each lie <em>(how the ball landed i.e. is laying on the ground)</em>\n</li>\n<li>know which club to suggest for each distance and each lie</li>\n<li>know physics to combine all the above</li>\n<li>are really good at physics to be really good at combining all the above</li>\n<li>have <em>only </em>four pockets but somehow hold extra balls, gloves, head covers, water bottles, scorecards, tees, a book, a laser, a towel, some snacks, a divot-tool, more water, and finally your dignity,</li>\n<li>last but not least, <strong>never</strong> lose site of a small white ball sometimes traveling over 130 mph a few hundred yards away that doesn’t make a sound and passes you in the blink of an eye which you are forced to do voluntarily because you look up into the sun to gauge the trajectory but have to blink fast enough and wipe away the tears of staring at the sun to ensure that the ball does not get lost</li>\n<li>do the above 17 more times, multiplied by each golfer, even if they’re not your own</li>\n</ul>\n<p>Caddying is hard, caddying is fun, but caddying is not easy, if the in-comprehensive and non-exhaustive previous list of tasks weren’t enough to clarify.</p>\n<p><strong>Me, Myself, and I</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/475/1*KQoKK4t_Lkl3P3N2dLKtqQ.png\"></figure><p>When you have all that time, you think a lot. Personally, I wrote random pieces, came up with random algorithms, and essentially tried to latch onto every side gig other caddies offered in search of another income stream.</p>\n<p>I learned how my brain worked, how I thought, how I organized my thoughts. I learned about what my goals in life were, what and where my purpose derived from. I learned about all the different forms of potential I had. I developed a strong work-ethic that I would never lose and a sphere of resilience. I became tough and patient. I became versatile and adaptive due to my role and responsibilities as a caddie.</p>\n<p>Caddying really put a lot of hair on my chest. Not literally (at least not directly intended as such), but I really came into my character. Every summer I aged a few extra months both through experience and maturity. I kept the wisdom I received and discovered a lot on my own. I can’t say I loved it, and I won’t say I never hated it, but I can honestly say I wouldn’t be the same person I am today if it wasn’t for my job as a caddie.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=da6c11ab4c1c\" width=\"1\" height=\"1\">\n",
            "enclosure": {},
            "categories": [
                "wisdom",
                "golf",
                "caddy",
                "work",
                "summer"
            ]
        },
        {
            "title": "5 — Golf and Caddying Part 1: My Summer Home with Amazing Encounters",
            "pubDate": "2018-01-29 20:07:29",
            "link": "https://medium.com/@tylercitrin/5-golf-and-caddying-part-1-my-summer-home-with-amazing-encounters-eea0d5376aa3?source=rss-28ed505e83f3------2",
            "guid": "https://medium.com/p/eea0d5376aa3",
            "author": "Tyler Citrin",
            "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*DuMwX4J2x3F3sVgz1ho3PQ.png",
            "description": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*DuMwX4J2x3F3sVgz1ho3PQ.png\"></figure><p>The summer after ninth grade is one to remember. It started off with two of my best friends, Alex Popescu and Jason Barreira, both of whom I played soccer with. Alex’s parents who both worked at the local golf course, told him he needed to work that summer. They suggested he caddy and find some friends to join him. Naturally, Alex asked Jason and I, and we both agreed to give it a shot. In hindsight, that request would eventually change my life forever.</p>\n<p>I didn’t know much about golf at the time. By that, I mean I didn’t know <strong><em>anything</em></strong> about golf. What I did not realize at the time is that I had earned a job caddying at Baltusrol Golf Club in Springfield, New Jersey, one of the oldest and most famous courses in the country, a place at which some of the biggest tournaments in the game had been held. With history buried in the soil on every hole, working here was a big deal, however, I had absolutely no idea of the significance until later into my career.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*MAcW-ihHUDtWgR0i7a5qLQ.jpeg\"></figure><p>The beginning of the summer was interesting, as I mentioned, we were soccer players, and really didn’t know golf. Among other variables, this made our time there a very slow start, but what I quickly realized is that caddying was no cake walk. Instead of going through the technicality and difficulties of caddying (which I will in a later article), I will begin by sharing a collection of encounters along the way.</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Round one</strong></h3>\n<p>I will never forget my very first loop. It was Alex and myself, accompanying two ladies for 9 holes on a warm Wednesday morning. One of the ladies was 23, and the other was, well, a grandma. Up until then, that would round would prove to be the longest 2 hours of my life.</p>\n<p>My golfer was the grandma, and Alex’s, the younger one. It is not uncommon for golfers to ask for tips and advice along the way, and often the protocol is whichever caddie is responsible for that golfer, more knowledgeable, or closer in proximity, in that order, take charge. Neither of us had much more knowledge than the other, but I had one thing over Alex; he was extremely shy and I was not!</p>\n<p>Alex’s golfer was very new to the game and barely knew the basics of the clubs, I also might add, she was very pleasing to look at, and at 14 the two of us were flabbergasted and astonished. She asked Alex for help, and reviewing the order above, I was not destined to be the one to give help based on any of the three rules!</p>\n<p>However, she asked, and he was silent. She then turned to me, asked, and I was silent as well, but for a different reason; I was daydreaming. I pictured one of those scenes in the movies, where I was the tall, dark, and handsome golf instructor on a private golf course where ironically there was no one else around, and we would link hands, as I taught her how to swing the club.</p>\n<p>I quickly returned from my euphoric state as I was by a ball Alex threw at me. Before responding and asking her to repeat her question I clearly missed, and given the extreme level of unprofessionalism of acting on my dream would have been, I thought to just tell her what I would do.</p>\n<p>But first, let’s bring this into perspective. Still not knowing anything about golf, I really needed to make a suggestion, and quickly pulled on anything and everything I knew from sports, physics, etc.</p>\n<p><strong>To review, for sports this included:</strong></p>\n<ul>\n<li>t-ball at age 8</li>\n<li>lacrosse at age 10</li>\n<li>tennis at age 12</li>\n<li>soccer ages 8-present</li>\n</ul>\n<p><strong>For physics, the axioms of:</strong></p>\n<ul>\n<li>of “what goes up must come down”</li>\n<li>“objects in motion stay in motion”</li>\n</ul>\n<p>If not immediately apparent, I had absolutely no idea what I was talking about. Not wanting her to know the sad truth, I combined all previous information and experience and was about to deliver my best educated guess, when I had a genius idea.</p>\n<p>I chose to play it safe, so I said I would start watching her swing as primary research. I mean really, how else could I provide advice if I don’t first know what the problem is. Also, aiding my adoration, how could I say no but to glance over in her direction with great fixation on her as she majestically swung her club.</p>\n<p>As much as I enjoyed the task, there is no nice way of putting it — she was not very good. One time she turned around and almost caught me staring, but I quickly corrected my composure, and produced <em>complex analysis</em> of what was wrong with her swing. Now I was able to deliver a slightly more educated guess, which proved to the golden ticket, whether by placebo or pure luck, for the rest of the round she greatly improved.</p>\n<p>After all was said and done, I got her number. No no, let’s not get carried away, not <em>her </em>number, the grandma’s. Not driven by intention, but through our conversation she learned that I joined a new soccer team and she asked if her grandson could contact me to come try out.</p>\n<p>So what did I learn after my first loop? Well, starting with the obvious, I needed to learn how to freakin’ golf. Almost as important, I needed learn how to make quick gut decisions and deal with people’s crap, AKA how to become a better bs’r. Also, definitely caddy with your best friend so at least one person has your back and perhaps get a girlfriend or control my pubescent-driven attractions.</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Employees</strong></h3>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/650/1*5ujC_svsHWjWEgOCoCCtQw.jpeg\"><figcaption>Brian Bianchi</figcaption></figure><p>Of all the interesting people I met, Brian Bianchi was one person who I developed a close relationship with. Brian was the caddy master which means that he was in charge of who went out and when, i.e, Brian had the power. He received the list of attendees, and made the decisions about who went out, when, and with whom. As you can see, Brian was a man you wanted on your side, not just because of his role, but because of his genuine character. Fortunately, between my age and my work ethic, he saw potential in me and would make me earn anything I received. It took time before I caught traction with him and the opportunity to showcase my skills and efforts. I became close with Brian, and down the road he supported me like no other, helping me achieve one of my greatest accomplishments (Part 3).</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Caddies</strong></h3>\n<p>Now it’s time for the caddies.</p>\n<p>I’ll start with those that were in my age range. Aside from Jason and Alex, there was Steven Gockel, the son of a father we’ll talk about later, Michael Lehr from Syracuse, Dave Reed from Colgate, and Garroid (I think) from Ireland. Another great friend of mine was Beatrice D…. D-im-ac-u-lan-gan… so we just called her B for short. She was one of the few female caddies and held her own in a big crowd, now at McGill–shameless plug, she’s a gifted artist of all trades and I would definitely check out her work!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*xbHjkRjl3sQa_kSbY0Pj3g.jpeg\"></figure><p>Then there were the famous Kirk brothers who all inspired me in different ways, an amazing trio, all extremely and uniquely talented; it’s scary to think what would happen if the three of them were one person, they or I guess he’d have my vote for president!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*jWiqm7TmE6fOJgrbDRnZ8g.jpeg\"><figcaption>The Kirk brothers</figcaption></figure><p>John Schwenck, whose name I still have trouble pronouncing. John and got very close, it was kind of destined to happen. We looked alike, acted alike, sounded alike, studied similar academic topics, and had similar interests. Everyone called us crazy for not being brothers, but we embraced it. We stay in touch because of trust and friendship that was built for us at the caddy yard.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/636/1*tIq3yMJqRH6ai9NZgpGyrQ.png\"><figcaption>Jason, Alex, John</figcaption></figure><p>Another amazing human being was Jack McDonald. He was just such a standup guy and we hit it off right away. I looked up to him, not because he was very tall, but because he was extremely genuine and driven. Jack was a kid who always had a smile on his face. He <em>really</em> listened and cared about what was going on in your life. One of the coolest things about Jack was an non-profit initiative he started for War Veterans called <a href=\"http://www.giticketsfoundation.org/?lipi=urn%3Ali%3Apage%3Ad_flagship3_company%3B0ZNTemLCS0GfO1o8JvQ%2FpQ%3D%3D\">“The GI Tickets Foundation”</a>, and I suggest you check it out. Jack definitely played a big role in my growth as a young adult and still acts as a true role model today.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/1*5vE7sKtC3IxdDUUJWqKj2w.jpeg\"><figcaption>Jack (out left) and the troops</figcaption></figure><p>Now, it’s time to look at the other 90% of the caddies who were all much older than me. Most of them only went by nicknames, but I am convinced some of those were their really names:</p>\n<p>First, there was Blockhead who was hardcore with a gold tooth, and a brother of three, at least that’s what he told me. You didn’t want to mess with him, but he liked me and protected me because I wasn’t afraid. The other two of the brother trio included Chris and Rick. Rick was the silent and gentle one who always asked how I was doing. Chris was also hardcore and was <em>really good </em>at Spades. Unfortunately, Chris made me play at the “kiddie table” as he bellowed in his deep voice, “boy I’ve been playin’ since before you were born, so know your place,” until one day “Uncle Travis,” another caddie, took me under his wing. Trav also had my back and we ran the table that day. Chris got so mad he threw his cards everywhere. All 100 caddies were crammed around the spades table where a <em>kid dethroned the king</em>. Brian came on the loudspeaker and told us we needed to be quiet from all the yelling and excitement or he would prohibit spades. I went into spades retirement for some time to let the table cool down.</p>\n<p>There was also Jonah and Andrew, the dynamic duo who took me on my second loop. These guys knew how to caddy like clockwork; they were a dream-team synced like a machine. Jonah and Andrew switched clubs, bags, balls, roles, golfers, sometimes even hats to mess with the golfers.They were both quiet, but they didn’t mess around on the course and if you slowed them down, they made you know it. I learned so much that day about how to be a good caddy and am grateful it was so early in my career.</p>\n<p>On the other side of the spectrum there was Oscar and Carlos who were comedians of the bunch. One day we were all out together, and I was assigned a quiet and older gentleman named Mr. Suttner. They told me he was the meanest of the mean, and this information had me ready to pee my pants, since it was only my third loop. They two told me he had gotten a few people fired for losing his clubs among other reasons. Naturally, being the jokesters they were, Oscar and Carlos took a club out of my bag when I wasn’t paying attention. When Mr. Suttner asked for that club that I found to be missing, my life flashed before my eyes, and I went pale. <em>Conveniently</em> though, Oscar came to save day, “don’t worry Mr. Suttner, Tyler <em>knew</em> you wanted it so he gave it to me to save time, ” he said. Immediately, my heart resumed its normal beating pattern. Later, I was texting, hiding behind my bag fore-caddying (waiting ahead for the ball), and Oscar wasn’t done yet. I wasn’t paying attention (again) because I knew Mr. Suttner wasn’t ready to hit, taking his sweet old time. In my own world on my phone, I returned to reality, awoken by a screeching “FOREEEEEEEEEE.” I dropped to the ground, covering my head as if I just heard a bomb siren. I then heard a thump, and behind the bag that saved my life, was the ball. I vowed to never text again while at work. After the round, Oscar told me saw me texting and threw a damn ball at me he had in his pocket. In addition, I also learned that my golfer was one of the nicest men around, he was just quiet and a Vet so his stern demeanor gave off that sense of fear. These were some valuable lessons I had to learn the hard way.</p>\n<p>There was Marion the Romanian, which is all but enough to have shared in common. He was good at chess, and by good, I mean he <em>never </em>lost. He wouldn’t play me because it wasn’t “worth his time,” but it was fun to watch him make his silent but deadly moves. Thankfully, Cleveland, who was arguably just as good at the game was there to teach me. He would still beat me after starting the game down quite a few pieces, and was also a black belt. I wondered why he didn’t pursue that as a career because he could do a high kick and knock a water bottle off my head. Speaking of peculiar skills, there was also Dave Reed the magician, who knew endless card tricks. For a while I kept him as my spades partner thinking there was a correlation. There wasn’t, so Jason (my other best friend) and I reunited and kept our seat at the big boy table.</p>\n<p>There was also Megatron, a short black guy with a moustache. He probably did steroids, and worked out more than he slept and had 0 fat on him. He was also the nicest guy around. Then there was Wax who was so tall and had his head so high in the clouds, he predicted the weather better than anyone, so I always asked him for the forecasts. He said “Tyler, just look up and you’ll see the level I’m at, no matter where you are, just look up.” He was cocky, but he was funny.</p>\n<p>There was Dempsey, but not the soccer player. This guy smoked a lot and made a lot of money, but refused to change his 5 year-old caddy shoes that barely had a sole. He bet money, but not as much as Larry the Looper. Larry had just turned 75 and Lord knows how long he really caddied for. The problem was that his gambling addiction was so strong he would caddy for a week then go down to Atlantic City and lose most of the money he made week after week. But even at his age, he still worked out 5 days a week and could have given Megatron a run for his money. Dempsey bet him $200 he couldn’t do one push per his age in years. Larry saw the dollar signs and heard the sound of dice hitting that craps table, and sure enough, he did all 75.</p>\n<p>There was Goat, who I guess looked like a goat because of his teeth, and spit accordingly. He called me “Richie Rich” like from the TV show, which was way back before my time, but I liked it anyway. There was Alex, Jay, and Gabe, a group of awesome Costa Ricans. We went out to breakfast together all the time at their secret Costa Rican joint, and I still go there to this day. Gabe is actually a special one, and i’ll talk about how he helped me in the next article. But the three of them looked after me, and helped me practice my Spanish that I could use to talk smack with Oscar and Carlos.</p>\n<p>There was a barber, I just called him barber… he cut my hair once or twice while waiting to work. There was Ozzy the Jamaican, we could barely understand him, but that guy knew how to make an entrance with style. He was the goofiest but most polite caddy around. His son actually trained with Jamaica in the Olympics as a sprinter, so that was pretty cool too. There were a few other Jamaican caddies I loved to listen to, especially when they got excited and started yelling like Steve and Dave; they didn’t have cool nicknames though, so I guess those were their real names.</p>\n<p>And then there was the class of full-timers, those that did twice a day, every day. There were the Chuffo brothers, both in their 50’s. They were really nice guys, who were really focused on their work. One smoked a few cigars a day, estimating $15,000 a year, while the other had a mint condition 2007 red corvette with 30,000 miles on it. Another of these was Roger, with long blonde hair, well, for the part of his head that wasn’t covered by his hat. Roger was the first one there all the time, sometimes before the security guard, which meant 5 am.</p>\n<p>There was Barbara, one of the very few females there. She was very attractive and I had a big crush on her. One day a bunch of the caddies decided to go see a movie. While Barbara was 18, I was only 16, so I had to convince her I was 18 as well. The age difference only became significant later on, when one night we went to see a rated-R movie. Now this isn’t a big deal, but I couldn’t get in, and if Barbara found out why, then my chances would have been ruined. Thankfully, someone thought of the pass-back, and given that this was a movie theater, they weren’t as strict as a bar. Kevin Kirk was the mastermind behind that plan, who I want to talk about later, because he played a role in the story to come involving Brian.</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Celebrities</strong></h3>\n<p>It is crazy looking back at some the people that I caddied for, and even more so those came to the golf club.</p>\n<p>One notable person was Tiger woods who came a few years before I started caddying, which was when his scandal took place. I even know the house! The whole situation was setup for his demise right from the start. He <strong><em>BOUGHT</em></strong> a house across the street from the golf course. This is hard to believe because he only bought it for use during the PGA Championship, which was a week in length. Regardless, perhaps without my intervention as a caddy, he had no other alternative but to succumbing to his ultimate demise. I guess I could have started a little younger to be there for him, to wave as a kid and say “Hey Mr. Woods, you got it dude, I believe in you.” Unfortunately, I would have been too young to caddy, and the golf bag would have weighed more than me, and so Mr. Woods went down a road of no return.</p>\n<p>To be honest, I really could not have done anything to prevent any of what Mr. Woods went through, but it’s still pretty cool to later walk the same path of one of the greatest players in the sport.</p>\n<p>The next year Wayne Gretzky and Samuel L. Jackson came to caddy. Now, I was just a kid, and no matter how smart or talented I was, only the best of the best caddies got these celebrities. I couldn’t even get near them. Wayne Gretzky for example, had a special caddy come just for him.</p>\n<p>Samuel L. Jackson didn’t have an Ex-Hollywood caddy, instead he had the best Jamaican caddies in the world (to my knowledge at least). I thought it would be the coolest thing after seeing all of this movies. I heard he was in to play one day, and I had to see for myself. I fortunately got a loop, as a round of work was called, and stayed on the lookout. In the distance I spotted a Jamaican Ralph Lauren Polo, and knew it had to be true, because I saw the Jamaican caddies with him. I forgot I already gave my golfers their driver. This is problematic because they were on the tee box ready to kick off. Thankfully, it was a raised box, because I ran across the fairway to meet good old Sammy. I almost got hit by a drive only 30 yards off the tee. The golfers yelled at me, and I ended up within 50 feet of him, but man it was a cool sight to see. I explained to my golfers the situation and they said they would have have done the same exact thing.</p>\n<p>Speaking of other famous coincidences, one time my sister was looking for full-time jobs as an engineer. When I got the chance to caddy for a man who worked at an engineering firm, I found the confidence, due to my good performance, to do some networking for her. The man obliged and asked about her education, her skills, where she was looking, etc. While I had forgotten the names of the companies she applied too, he said he would give me his contact info for us to stay in touch. I went home later that evening and said “Rebecca, I met this guy who worked at an engineering firm and he asked me where you were applying… but I forgot.” So she told me and it stuck with me. I went to my uniform to check for the contact info and realized he forgot to give it to me. I wasn’t going to give up, and ironically I knew his son and followed up the next time I saw him about 3 weeks later. I got his dad’s info, along with the company name. The funny thing is, he didn’t just <em>work</em> at the engineering firm, he was the CEO. The funnier thing is that it was one of the companies my sister had already applied for. Moral of the story, never forget a business card or point of contact, but good thing is she got the job before I even got the information and didn’t need any help. It is still a fun thing to hang over her head that she better be nice to me because I knew her Boss’s Boss.</p>\n<p>The day after I retired Mr. Michael Bloomberg from New York came to play and Alex, the best friend who got me the job, was his caddy for the day. Man I was so jealous because I love business and technology, but what are you going to do. I later applied for his company but didn’t get the position. Maybe if I was able to showcase my skills things would have been different.</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Golfers</strong></h3>\n<p>Taking a break from my famous encounters, I also met a bunch of amazing people that really became an integral part of my life and left with me with many memories.</p>\n<p>If it wasn’t apparent before, I was the ladies man. Every Wednesday I had my usual date with Mrs. Pelicci, and often her pal Susan Britt, who were some of nicest golfers I ever met. They treated me so well. We would stroll around the course and chat, and never worry about the time. I felt like they each resembled a part of my grandmothers, which meant a lot to me given past events. Sometimes they would rotate, and one of them would come with new friends, always eager to introduce me.</p>\n<p>There was one Wednesday that was unique. Both of my regulars were out and I was left with Ms. Clark, who was one of the older golfers with cataracts. It was just she and I, and we had a cart to make it easier. I was driving, and I leaned out of the car to pick up the spare ball while we were coasting slowly. Poor, kind Ms. Clark thought I fell out, quickly grabbed the steering-wheel, and extended her short legs to slam on the break. Unfortunately, she stepped on the gas by mistake, which caused her to be whipped around. Still clenching the wheel, momentum took over, and the cart started tipping to the point where I was almost crushed by it. We hit a bump, which caused the same incident to thankfully occur in reverse and turn us the other direction. I was pulled back into the cart and quickly slammed on the break. I decided I would no longer employ the “Jersey Rolling Stop.” She meant well, and that’s what really mattered.</p>\n<p>Later in my caddie career I was working on a startup company (stay tuned), and I met quite a few people who took special interest in those endeavors. The first was Jason Yuhas. Jason came as a guest one day and we hit it off right away. We had a lot in common and we just clicked. Jason became a mentor to me and helped coach me throughout the business development process and we’ve been friends ever since. A few months later I actually met him in New York at a bar in the only cheap suit I could find on short notice. It was quite a fun evening, and an even longer night. I thought after a few drinks I could convince him to make an investment, I guess it was take a shot (no pun intended). He helped me understand the steps I needed to take to get there, and thankfully I wrote them down because I wouldn’t have remembered. We went our separate ways at 12:50 AM, wherein I had to catch the last train out at 1:02, which was a 20 minute walk across a few city blocks, all with a dead phone and an empty wallet. Somehow, I made it, and obviously made it home because one of my best friends, Tom Feld, was there waiting for me. He unlocked the car, yelled at me to get in, and gave me a nice “you dumba**” with a slap across the face.</p>\n<p>A few weeks later, taking a shot in the dark, after the progress I made with Jason, I wanted to continue my networking efforts. I figured I had nothing to lose, and one day I was caddying for a man named Robert Polakowski. Bob was a retired politician, with most of his work in lobbying. Bob was eager for an opportunity to invest , as was I. Overtime we started meeting, showing him everything I had accomplished with Jason, and he helped me learn how to make decisions and really get my point across concisely with support. Bob introduced me to David Reeth, a financial prodigy who took an active role as well. They were the perfect balance between Bob’s wisdom and David’s shrewdness. I made lasting mentors and acquired the knowledge to eventually obtain investments down the road.</p>\n<p>Another significant person was a guest named William Mullan. Will was a cool young dude who thought my idea had potential. He wasn’t an investor, but he had some cool friends. Paull Young was one of them, who worked at Instagram which was just bought by Facebook (at the time). Will setup a meeting for the three of us at the Facebook office in New York. That was an incredible experience; it felt like I was watching the “Social Network” or was actually in Silicon Valley. I got the opportunity to pitch and share my idea to someone who had more experience than the others in the industry, which helped me get on track.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/940/1*cq6L9uOIqZ2A5Q6wP1i0cw.jpeg\"><figcaption>Facebook HQ in NY</figcaption></figure><p>Another very influential man I met was James Longley who was playing with his long-time buddy John Scally. He was a nice retired banker, and he was ready to put me to the test. James is an extremely wise man, always finding ways to pass on wisdom he gained throughout his career. He was a hard worker and a cut-to-the-chase kind of guy, quite the opposite of me. Although, with his help, I have been trying to get there as well. Overtime we drifted, but I reached back out a few years later and we picked up right where we left off. We spent a lot of time catching up, and once again James was there to help me through some of the biggest decisions I had to make with recruiting and my career. When I told him my actions or thought processes along the way he replied with great amazement as to how far I came. That feeling of making him proud was such an accomplishment, because I was able to show him that I really took his teachings to heart.</p>\n<p>I know there are many stories that I probably don’t remember right now, but these are among the few that stood out and were the most memorable. I hope you enjoyed reading about some of the cool and fun sides of caddying, because the next article is about the difficulties of the job and the adversities I faced, stay tuned!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=eea0d5376aa3\" width=\"1\" height=\"1\">\n",
            "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*DuMwX4J2x3F3sVgz1ho3PQ.png\"></figure><p>The summer after ninth grade is one to remember. It started off with two of my best friends, Alex Popescu and Jason Barreira, both of whom I played soccer with. Alex’s parents who both worked at the local golf course, told him he needed to work that summer. They suggested he caddy and find some friends to join him. Naturally, Alex asked Jason and I, and we both agreed to give it a shot. In hindsight, that request would eventually change my life forever.</p>\n<p>I didn’t know much about golf at the time. By that, I mean I didn’t know <strong><em>anything</em></strong> about golf. What I did not realize at the time is that I had earned a job caddying at Baltusrol Golf Club in Springfield, New Jersey, one of the oldest and most famous courses in the country, a place at which some of the biggest tournaments in the game had been held. With history buried in the soil on every hole, working here was a big deal, however, I had absolutely no idea of the significance until later into my career.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*MAcW-ihHUDtWgR0i7a5qLQ.jpeg\"></figure><p>The beginning of the summer was interesting, as I mentioned, we were soccer players, and really didn’t know golf. Among other variables, this made our time there a very slow start, but what I quickly realized is that caddying was no cake walk. Instead of going through the technicality and difficulties of caddying (which I will in a later article), I will begin by sharing a collection of encounters along the way.</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Round one</strong></h3>\n<p>I will never forget my very first loop. It was Alex and myself, accompanying two ladies for 9 holes on a warm Wednesday morning. One of the ladies was 23, and the other was, well, a grandma. Up until then, that would round would prove to be the longest 2 hours of my life.</p>\n<p>My golfer was the grandma, and Alex’s, the younger one. It is not uncommon for golfers to ask for tips and advice along the way, and often the protocol is whichever caddie is responsible for that golfer, more knowledgeable, or closer in proximity, in that order, take charge. Neither of us had much more knowledge than the other, but I had one thing over Alex; he was extremely shy and I was not!</p>\n<p>Alex’s golfer was very new to the game and barely knew the basics of the clubs, I also might add, she was very pleasing to look at, and at 14 the two of us were flabbergasted and astonished. She asked Alex for help, and reviewing the order above, I was not destined to be the one to give help based on any of the three rules!</p>\n<p>However, she asked, and he was silent. She then turned to me, asked, and I was silent as well, but for a different reason; I was daydreaming. I pictured one of those scenes in the movies, where I was the tall, dark, and handsome golf instructor on a private golf course where ironically there was no one else around, and we would link hands, as I taught her how to swing the club.</p>\n<p>I quickly returned from my euphoric state as I was by a ball Alex threw at me. Before responding and asking her to repeat her question I clearly missed, and given the extreme level of unprofessionalism of acting on my dream would have been, I thought to just tell her what I would do.</p>\n<p>But first, let’s bring this into perspective. Still not knowing anything about golf, I really needed to make a suggestion, and quickly pulled on anything and everything I knew from sports, physics, etc.</p>\n<p><strong>To review, for sports this included:</strong></p>\n<ul>\n<li>t-ball at age 8</li>\n<li>lacrosse at age 10</li>\n<li>tennis at age 12</li>\n<li>soccer ages 8-present</li>\n</ul>\n<p><strong>For physics, the axioms of:</strong></p>\n<ul>\n<li>of “what goes up must come down”</li>\n<li>“objects in motion stay in motion”</li>\n</ul>\n<p>If not immediately apparent, I had absolutely no idea what I was talking about. Not wanting her to know the sad truth, I combined all previous information and experience and was about to deliver my best educated guess, when I had a genius idea.</p>\n<p>I chose to play it safe, so I said I would start watching her swing as primary research. I mean really, how else could I provide advice if I don’t first know what the problem is. Also, aiding my adoration, how could I say no but to glance over in her direction with great fixation on her as she majestically swung her club.</p>\n<p>As much as I enjoyed the task, there is no nice way of putting it — she was not very good. One time she turned around and almost caught me staring, but I quickly corrected my composure, and produced <em>complex analysis</em> of what was wrong with her swing. Now I was able to deliver a slightly more educated guess, which proved to the golden ticket, whether by placebo or pure luck, for the rest of the round she greatly improved.</p>\n<p>After all was said and done, I got her number. No no, let’s not get carried away, not <em>her </em>number, the grandma’s. Not driven by intention, but through our conversation she learned that I joined a new soccer team and she asked if her grandson could contact me to come try out.</p>\n<p>So what did I learn after my first loop? Well, starting with the obvious, I needed to learn how to freakin’ golf. Almost as important, I needed learn how to make quick gut decisions and deal with people’s crap, AKA how to become a better bs’r. Also, definitely caddy with your best friend so at least one person has your back and perhaps get a girlfriend or control my pubescent-driven attractions.</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Employees</strong></h3>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/650/1*5ujC_svsHWjWEgOCoCCtQw.jpeg\"><figcaption>Brian Bianchi</figcaption></figure><p>Of all the interesting people I met, Brian Bianchi was one person who I developed a close relationship with. Brian was the caddy master which means that he was in charge of who went out and when, i.e, Brian had the power. He received the list of attendees, and made the decisions about who went out, when, and with whom. As you can see, Brian was a man you wanted on your side, not just because of his role, but because of his genuine character. Fortunately, between my age and my work ethic, he saw potential in me and would make me earn anything I received. It took time before I caught traction with him and the opportunity to showcase my skills and efforts. I became close with Brian, and down the road he supported me like no other, helping me achieve one of my greatest accomplishments (Part 3).</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Caddies</strong></h3>\n<p>Now it’s time for the caddies.</p>\n<p>I’ll start with those that were in my age range. Aside from Jason and Alex, there was Steven Gockel, the son of a father we’ll talk about later, Michael Lehr from Syracuse, Dave Reed from Colgate, and Garroid (I think) from Ireland. Another great friend of mine was Beatrice D…. D-im-ac-u-lan-gan… so we just called her B for short. She was one of the few female caddies and held her own in a big crowd, now at McGill–shameless plug, she’s a gifted artist of all trades and I would definitely check out her work!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*xbHjkRjl3sQa_kSbY0Pj3g.jpeg\"></figure><p>Then there were the famous Kirk brothers who all inspired me in different ways, an amazing trio, all extremely and uniquely talented; it’s scary to think what would happen if the three of them were one person, they or I guess he’d have my vote for president!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*jWiqm7TmE6fOJgrbDRnZ8g.jpeg\"><figcaption>The Kirk brothers</figcaption></figure><p>John Schwenck, whose name I still have trouble pronouncing. John and got very close, it was kind of destined to happen. We looked alike, acted alike, sounded alike, studied similar academic topics, and had similar interests. Everyone called us crazy for not being brothers, but we embraced it. We stay in touch because of trust and friendship that was built for us at the caddy yard.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/636/1*tIq3yMJqRH6ai9NZgpGyrQ.png\"><figcaption>Jason, Alex, John</figcaption></figure><p>Another amazing human being was Jack McDonald. He was just such a standup guy and we hit it off right away. I looked up to him, not because he was very tall, but because he was extremely genuine and driven. Jack was a kid who always had a smile on his face. He <em>really</em> listened and cared about what was going on in your life. One of the coolest things about Jack was an non-profit initiative he started for War Veterans called <a href=\"http://www.giticketsfoundation.org/?lipi=urn%3Ali%3Apage%3Ad_flagship3_company%3B0ZNTemLCS0GfO1o8JvQ%2FpQ%3D%3D\">“The GI Tickets Foundation”</a>, and I suggest you check it out. Jack definitely played a big role in my growth as a young adult and still acts as a true role model today.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/1*5vE7sKtC3IxdDUUJWqKj2w.jpeg\"><figcaption>Jack (out left) and the troops</figcaption></figure><p>Now, it’s time to look at the other 90% of the caddies who were all much older than me. Most of them only went by nicknames, but I am convinced some of those were their really names:</p>\n<p>First, there was Blockhead who was hardcore with a gold tooth, and a brother of three, at least that’s what he told me. You didn’t want to mess with him, but he liked me and protected me because I wasn’t afraid. The other two of the brother trio included Chris and Rick. Rick was the silent and gentle one who always asked how I was doing. Chris was also hardcore and was <em>really good </em>at Spades. Unfortunately, Chris made me play at the “kiddie table” as he bellowed in his deep voice, “boy I’ve been playin’ since before you were born, so know your place,” until one day “Uncle Travis,” another caddie, took me under his wing. Trav also had my back and we ran the table that day. Chris got so mad he threw his cards everywhere. All 100 caddies were crammed around the spades table where a <em>kid dethroned the king</em>. Brian came on the loudspeaker and told us we needed to be quiet from all the yelling and excitement or he would prohibit spades. I went into spades retirement for some time to let the table cool down.</p>\n<p>There was also Jonah and Andrew, the dynamic duo who took me on my second loop. These guys knew how to caddy like clockwork; they were a dream-team synced like a machine. Jonah and Andrew switched clubs, bags, balls, roles, golfers, sometimes even hats to mess with the golfers.They were both quiet, but they didn’t mess around on the course and if you slowed them down, they made you know it. I learned so much that day about how to be a good caddy and am grateful it was so early in my career.</p>\n<p>On the other side of the spectrum there was Oscar and Carlos who were comedians of the bunch. One day we were all out together, and I was assigned a quiet and older gentleman named Mr. Suttner. They told me he was the meanest of the mean, and this information had me ready to pee my pants, since it was only my third loop. They two told me he had gotten a few people fired for losing his clubs among other reasons. Naturally, being the jokesters they were, Oscar and Carlos took a club out of my bag when I wasn’t paying attention. When Mr. Suttner asked for that club that I found to be missing, my life flashed before my eyes, and I went pale. <em>Conveniently</em> though, Oscar came to save day, “don’t worry Mr. Suttner, Tyler <em>knew</em> you wanted it so he gave it to me to save time, ” he said. Immediately, my heart resumed its normal beating pattern. Later, I was texting, hiding behind my bag fore-caddying (waiting ahead for the ball), and Oscar wasn’t done yet. I wasn’t paying attention (again) because I knew Mr. Suttner wasn’t ready to hit, taking his sweet old time. In my own world on my phone, I returned to reality, awoken by a screeching “FOREEEEEEEEEE.” I dropped to the ground, covering my head as if I just heard a bomb siren. I then heard a thump, and behind the bag that saved my life, was the ball. I vowed to never text again while at work. After the round, Oscar told me saw me texting and threw a damn ball at me he had in his pocket. In addition, I also learned that my golfer was one of the nicest men around, he was just quiet and a Vet so his stern demeanor gave off that sense of fear. These were some valuable lessons I had to learn the hard way.</p>\n<p>There was Marion the Romanian, which is all but enough to have shared in common. He was good at chess, and by good, I mean he <em>never </em>lost. He wouldn’t play me because it wasn’t “worth his time,” but it was fun to watch him make his silent but deadly moves. Thankfully, Cleveland, who was arguably just as good at the game was there to teach me. He would still beat me after starting the game down quite a few pieces, and was also a black belt. I wondered why he didn’t pursue that as a career because he could do a high kick and knock a water bottle off my head. Speaking of peculiar skills, there was also Dave Reed the magician, who knew endless card tricks. For a while I kept him as my spades partner thinking there was a correlation. There wasn’t, so Jason (my other best friend) and I reunited and kept our seat at the big boy table.</p>\n<p>There was also Megatron, a short black guy with a moustache. He probably did steroids, and worked out more than he slept and had 0 fat on him. He was also the nicest guy around. Then there was Wax who was so tall and had his head so high in the clouds, he predicted the weather better than anyone, so I always asked him for the forecasts. He said “Tyler, just look up and you’ll see the level I’m at, no matter where you are, just look up.” He was cocky, but he was funny.</p>\n<p>There was Dempsey, but not the soccer player. This guy smoked a lot and made a lot of money, but refused to change his 5 year-old caddy shoes that barely had a sole. He bet money, but not as much as Larry the Looper. Larry had just turned 75 and Lord knows how long he really caddied for. The problem was that his gambling addiction was so strong he would caddy for a week then go down to Atlantic City and lose most of the money he made week after week. But even at his age, he still worked out 5 days a week and could have given Megatron a run for his money. Dempsey bet him $200 he couldn’t do one push per his age in years. Larry saw the dollar signs and heard the sound of dice hitting that craps table, and sure enough, he did all 75.</p>\n<p>There was Goat, who I guess looked like a goat because of his teeth, and spit accordingly. He called me “Richie Rich” like from the TV show, which was way back before my time, but I liked it anyway. There was Alex, Jay, and Gabe, a group of awesome Costa Ricans. We went out to breakfast together all the time at their secret Costa Rican joint, and I still go there to this day. Gabe is actually a special one, and i’ll talk about how he helped me in the next article. But the three of them looked after me, and helped me practice my Spanish that I could use to talk smack with Oscar and Carlos.</p>\n<p>There was a barber, I just called him barber… he cut my hair once or twice while waiting to work. There was Ozzy the Jamaican, we could barely understand him, but that guy knew how to make an entrance with style. He was the goofiest but most polite caddy around. His son actually trained with Jamaica in the Olympics as a sprinter, so that was pretty cool too. There were a few other Jamaican caddies I loved to listen to, especially when they got excited and started yelling like Steve and Dave; they didn’t have cool nicknames though, so I guess those were their real names.</p>\n<p>And then there was the class of full-timers, those that did twice a day, every day. There were the Chuffo brothers, both in their 50’s. They were really nice guys, who were really focused on their work. One smoked a few cigars a day, estimating $15,000 a year, while the other had a mint condition 2007 red corvette with 30,000 miles on it. Another of these was Roger, with long blonde hair, well, for the part of his head that wasn’t covered by his hat. Roger was the first one there all the time, sometimes before the security guard, which meant 5 am.</p>\n<p>There was Barbara, one of the very few females there. She was very attractive and I had a big crush on her. One day a bunch of the caddies decided to go see a movie. While Barbara was 18, I was only 16, so I had to convince her I was 18 as well. The age difference only became significant later on, when one night we went to see a rated-R movie. Now this isn’t a big deal, but I couldn’t get in, and if Barbara found out why, then my chances would have been ruined. Thankfully, someone thought of the pass-back, and given that this was a movie theater, they weren’t as strict as a bar. Kevin Kirk was the mastermind behind that plan, who I want to talk about later, because he played a role in the story to come involving Brian.</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Celebrities</strong></h3>\n<p>It is crazy looking back at some the people that I caddied for, and even more so those came to the golf club.</p>\n<p>One notable person was Tiger woods who came a few years before I started caddying, which was when his scandal took place. I even know the house! The whole situation was setup for his demise right from the start. He <strong><em>BOUGHT</em></strong> a house across the street from the golf course. This is hard to believe because he only bought it for use during the PGA Championship, which was a week in length. Regardless, perhaps without my intervention as a caddy, he had no other alternative but to succumbing to his ultimate demise. I guess I could have started a little younger to be there for him, to wave as a kid and say “Hey Mr. Woods, you got it dude, I believe in you.” Unfortunately, I would have been too young to caddy, and the golf bag would have weighed more than me, and so Mr. Woods went down a road of no return.</p>\n<p>To be honest, I really could not have done anything to prevent any of what Mr. Woods went through, but it’s still pretty cool to later walk the same path of one of the greatest players in the sport.</p>\n<p>The next year Wayne Gretzky and Samuel L. Jackson came to caddy. Now, I was just a kid, and no matter how smart or talented I was, only the best of the best caddies got these celebrities. I couldn’t even get near them. Wayne Gretzky for example, had a special caddy come just for him.</p>\n<p>Samuel L. Jackson didn’t have an Ex-Hollywood caddy, instead he had the best Jamaican caddies in the world (to my knowledge at least). I thought it would be the coolest thing after seeing all of this movies. I heard he was in to play one day, and I had to see for myself. I fortunately got a loop, as a round of work was called, and stayed on the lookout. In the distance I spotted a Jamaican Ralph Lauren Polo, and knew it had to be true, because I saw the Jamaican caddies with him. I forgot I already gave my golfers their driver. This is problematic because they were on the tee box ready to kick off. Thankfully, it was a raised box, because I ran across the fairway to meet good old Sammy. I almost got hit by a drive only 30 yards off the tee. The golfers yelled at me, and I ended up within 50 feet of him, but man it was a cool sight to see. I explained to my golfers the situation and they said they would have have done the same exact thing.</p>\n<p>Speaking of other famous coincidences, one time my sister was looking for full-time jobs as an engineer. When I got the chance to caddy for a man who worked at an engineering firm, I found the confidence, due to my good performance, to do some networking for her. The man obliged and asked about her education, her skills, where she was looking, etc. While I had forgotten the names of the companies she applied too, he said he would give me his contact info for us to stay in touch. I went home later that evening and said “Rebecca, I met this guy who worked at an engineering firm and he asked me where you were applying… but I forgot.” So she told me and it stuck with me. I went to my uniform to check for the contact info and realized he forgot to give it to me. I wasn’t going to give up, and ironically I knew his son and followed up the next time I saw him about 3 weeks later. I got his dad’s info, along with the company name. The funny thing is, he didn’t just <em>work</em> at the engineering firm, he was the CEO. The funnier thing is that it was one of the companies my sister had already applied for. Moral of the story, never forget a business card or point of contact, but good thing is she got the job before I even got the information and didn’t need any help. It is still a fun thing to hang over her head that she better be nice to me because I knew her Boss’s Boss.</p>\n<p>The day after I retired Mr. Michael Bloomberg from New York came to play and Alex, the best friend who got me the job, was his caddy for the day. Man I was so jealous because I love business and technology, but what are you going to do. I later applied for his company but didn’t get the position. Maybe if I was able to showcase my skills things would have been different.</p>\n<p>- — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —</p>\n<h3><strong>Golfers</strong></h3>\n<p>Taking a break from my famous encounters, I also met a bunch of amazing people that really became an integral part of my life and left with me with many memories.</p>\n<p>If it wasn’t apparent before, I was the ladies man. Every Wednesday I had my usual date with Mrs. Pelicci, and often her pal Susan Britt, who were some of nicest golfers I ever met. They treated me so well. We would stroll around the course and chat, and never worry about the time. I felt like they each resembled a part of my grandmothers, which meant a lot to me given past events. Sometimes they would rotate, and one of them would come with new friends, always eager to introduce me.</p>\n<p>There was one Wednesday that was unique. Both of my regulars were out and I was left with Ms. Clark, who was one of the older golfers with cataracts. It was just she and I, and we had a cart to make it easier. I was driving, and I leaned out of the car to pick up the spare ball while we were coasting slowly. Poor, kind Ms. Clark thought I fell out, quickly grabbed the steering-wheel, and extended her short legs to slam on the break. Unfortunately, she stepped on the gas by mistake, which caused her to be whipped around. Still clenching the wheel, momentum took over, and the cart started tipping to the point where I was almost crushed by it. We hit a bump, which caused the same incident to thankfully occur in reverse and turn us the other direction. I was pulled back into the cart and quickly slammed on the break. I decided I would no longer employ the “Jersey Rolling Stop.” She meant well, and that’s what really mattered.</p>\n<p>Later in my caddie career I was working on a startup company (stay tuned), and I met quite a few people who took special interest in those endeavors. The first was Jason Yuhas. Jason came as a guest one day and we hit it off right away. We had a lot in common and we just clicked. Jason became a mentor to me and helped coach me throughout the business development process and we’ve been friends ever since. A few months later I actually met him in New York at a bar in the only cheap suit I could find on short notice. It was quite a fun evening, and an even longer night. I thought after a few drinks I could convince him to make an investment, I guess it was take a shot (no pun intended). He helped me understand the steps I needed to take to get there, and thankfully I wrote them down because I wouldn’t have remembered. We went our separate ways at 12:50 AM, wherein I had to catch the last train out at 1:02, which was a 20 minute walk across a few city blocks, all with a dead phone and an empty wallet. Somehow, I made it, and obviously made it home because one of my best friends, Tom Feld, was there waiting for me. He unlocked the car, yelled at me to get in, and gave me a nice “you dumba**” with a slap across the face.</p>\n<p>A few weeks later, taking a shot in the dark, after the progress I made with Jason, I wanted to continue my networking efforts. I figured I had nothing to lose, and one day I was caddying for a man named Robert Polakowski. Bob was a retired politician, with most of his work in lobbying. Bob was eager for an opportunity to invest , as was I. Overtime we started meeting, showing him everything I had accomplished with Jason, and he helped me learn how to make decisions and really get my point across concisely with support. Bob introduced me to David Reeth, a financial prodigy who took an active role as well. They were the perfect balance between Bob’s wisdom and David’s shrewdness. I made lasting mentors and acquired the knowledge to eventually obtain investments down the road.</p>\n<p>Another significant person was a guest named William Mullan. Will was a cool young dude who thought my idea had potential. He wasn’t an investor, but he had some cool friends. Paull Young was one of them, who worked at Instagram which was just bought by Facebook (at the time). Will setup a meeting for the three of us at the Facebook office in New York. That was an incredible experience; it felt like I was watching the “Social Network” or was actually in Silicon Valley. I got the opportunity to pitch and share my idea to someone who had more experience than the others in the industry, which helped me get on track.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/940/1*cq6L9uOIqZ2A5Q6wP1i0cw.jpeg\"><figcaption>Facebook HQ in NY</figcaption></figure><p>Another very influential man I met was James Longley who was playing with his long-time buddy John Scally. He was a nice retired banker, and he was ready to put me to the test. James is an extremely wise man, always finding ways to pass on wisdom he gained throughout his career. He was a hard worker and a cut-to-the-chase kind of guy, quite the opposite of me. Although, with his help, I have been trying to get there as well. Overtime we drifted, but I reached back out a few years later and we picked up right where we left off. We spent a lot of time catching up, and once again James was there to help me through some of the biggest decisions I had to make with recruiting and my career. When I told him my actions or thought processes along the way he replied with great amazement as to how far I came. That feeling of making him proud was such an accomplishment, because I was able to show him that I really took his teachings to heart.</p>\n<p>I know there are many stories that I probably don’t remember right now, but these are among the few that stood out and were the most memorable. I hope you enjoyed reading about some of the cool and fun sides of caddying, because the next article is about the difficulties of the job and the adversities I faced, stay tuned!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=eea0d5376aa3\" width=\"1\" height=\"1\">\n",
            "enclosure": {},
            "categories": [
                "networking",
                "storytelling",
                "people",
                "summer",
                "golf"
            ]
        },
        {
            "title": "4 — The Camaraderie, Culture, and Beauty of Soccer",
            "pubDate": "2018-01-21 15:49:41",
            "link": "https://medium.com/@tylercitrin/4-the-camaraderie-culture-and-beauty-of-soccer-ba1012b4f363?source=rss-28ed505e83f3------2",
            "guid": "https://medium.com/p/ba1012b4f363",
            "author": "Tyler Citrin",
            "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*IujU4AbX5PhIKKX101v-HA.jpeg",
            "description": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*IujU4AbX5PhIKKX101v-HA.jpeg\"><figcaption>The Last Picture</figcaption></figure><h3>4 — The Camaraderie, Culture, and Beauty of Soccer</h3>\n<p><strong><em>preface: </em></strong><em>Given the nature of this series, spanning the last 11 years of my life (chronologically), I will be writing each story in first-person as if I was writing at that age.</em></p>\n<p><strong>ages:</strong> 10–16 <em>(but truly very young-to hopefully the rest of my life)</em></p>\n<p>Following up after my last article, I cannot say enough how much soccer is an important part of my life. It was my first team sport that I started from a young age. I was eventually coached by my father, who traveled all over, posting flyers, articles, etc. trying to recruit players to our team. Our team was very unique because of this, which started a trend of diversity throughout my soccer career.</p>\n<p>As time went on I played for each school team in addition to my town’s team. Unfortunately, I was quite inhibited by my (over)weight. I was slow, had low endurance, and as a result was eventually pressured to transition to goalie. The saying was, “someone had to do it,” and it made the most sense given my physical status at the time.</p>\n<p>I aspired to be a field player, which was another huge motivator as mentioned in previous article. I refused to be held back from my potential and desire. In addition working out and eating better, I thought what better way to get in shape for soccer then to take every opportunity I had to actually play. Not only did this make me better, it improved self esteem in that i could achieve what I wanted.</p>\n<p>With these new abilities, I found confidence and started trying out for teams. Season after season I moved up and up; year after year the teams I joined were better and better. This was rated first by better towns, then by better counties, then eventually clubs and premier teams, competing at the state level.</p>\n<p>Going into high school and preparing to tryout for the most advanced team I would join, I needed to be in tip-top shape. Thankfully, one day my mother was walking around the track when she was passed by a runner flying by at lightning speed. She thought nothing of it, until it happened a few more times. He stopped stretch on the side, and my mother approached him, asking who he was and why he was there.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/1*QWql6NqCUA50sN0-J2Ybxg.jpeg\"><figcaption>Dayon Cobbs</figcaption></figure><p>The man’s name was Dayon. He was a fireman out of Newark, NJ, training for the World Police and Fire Games, wherein he was on a sprinting relay team. Astonished, she asked him to become my trainer. He explained to her that he had never trained anyone before and he didn’t feel comfortable even after my mother offered to pay. He was very reluctant, but my 5-foot tall mother hounded him and wouldn’t take no for answer. Sure enough, no matter how tough he was, he conceded and became my trainer.</p>\n<p>Given that I was guinea pig for what would become a new side gig of his, he thought what better way to start then the most obvious: follow his routine. Dayon was a well conditioned college track athlete and now fireman. He pushed me way beyond my limit, and the more I hated it, the more I loved it. A little discouraged, I asked him after a few weeks, “Dayon, how do I know if I am making progress if I am always behind and chasing you?” His smart-ass remark, “when I start chasing you” was all I needed to continue. Although I never caught him, I owe a great deal to Dayon who taught me a lot on and off the track. He was extremely humble and wise, which was a true motivator and proved wonders.</p>\n<p>I eventually made varsity, proceeding up through captain and receiving state nominations. Year after year as the competition got better, so too did I. When of the biggest traits I had to offer was that I was always there and <em>clutch</em> when I was needed the most.</p>\n<p><strong>Sophomore year:</strong></p>\n<ul><li>For example, on the way to States sophomore year, I took my first ever penalty kick in a shootout. Fortunately I made it (It would have been better if it was my last though).</li></ul>\n<p><strong>Junior Year:</strong></p>\n<ul><li>The following year, around the same time in the season, we played against a team we never beat in history, who was destined to win yet again, claiming their 25th state championship. I was coming off an injury from the previous game, and almost didn’t play. However I suited up and gave everything I had. There was a weak clearance from the defender off our corner kick, and some 30 yards out the ball caressed my chest, bounced off the floor, and led by my boot, with such force and spin, defied the laws of physics, bending from the middle of the field to the top right corner of the goal. The opposing team’s fans went silent as their jaws dropped, along with mine as I and the stadium was left in awe. I’ve never been able to recreate that shot, and I selfishly hope it never does, for it was a statement and legacy I left on that field.</li></ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*087QvzkTzBrK_lXUGb_GIQ.jpeg\"><figcaption>Giving one of my pre-game Speeches</figcaption></figure><p><strong>Senior Year:</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*AQ5kVHIYI4ESxeKAcv-KNA.jpeg\"><figcaption>Coach Fabs</figcaption></figure><ul>\n<li>Clutch was one adjective I appreciated, along with adaptable. Four games into the season, our chemistry was off and we needed a change. On the 5th game, when conference matches would start, the unthinkable happened. We were in the huddle with good old Fabiano, the longest running soccer coach in history. On a side note, he has lasted so long because of his good eating habits and strong core; he would run the field workouts and perform better or equal to our most athletic players. Anyway, we were in the huddle, and Fabs gave us the talk followed by the line up that had been the same for the previous 4 games in addition to pre-season. He switched myself at Center-Midfield to Center-Back with another player. Assuming it was a mistake, the other player and I looked at each other and then at Fabs, and inquired what we just knew to be incorrect. He said, I will give the line up again, and he did, with the same mistake.</li>\n<li>This moment was set up to be either the turning point or downfall of our season, as he put two of the top players in flipped positions they were unfamiliar with. Within three games, our chemistry sky-rocketed. Whether intentional or luck, Fabs figured it out. I asked him one day which it was, and he told me that it was luck, however, it was inspired by his intuition, which then came from his good coaching skills… and then he summarized, “You have to be good in order to be lucky.” Man I took that to heart, and what a placebo axiom it was! Nevertheless I went on to having my best season, accusing many accolades and earning the title the “Rock at the Back.”</li>\n<li>Marching to states we beat some great teams along the way. Entering the semi’s against we were set to face our hated rival. They were favored to win, and sure enough the refs were even from their town. This second part proved harmful because we couldn’t catch a break on anything–they were against us and used their authority to prove it, dishing out warnings and yellow cards like fliers. The game was at their home field in 20 degree weather, still snowing.</li>\n<li>In high school, the halves are 40 minutes long, so keep this mind throughout the following calculations. During the first half there were 7 minutes of added time to injuries and disputes. After those 47 minutes, the game was scoreless. The second half proceed, and 15 minutes in, one of our players received a second yellow, which turned to red, leaving us a man down. Now we were 62 minutes in and a man down with 25 minutes left in regulation. The score remained the same for the next 20 or so minutes. It wasn’t until 82 minutes and only 3 left in regulation, we conceded a free kick, resulting in the first goal. I was sent off in one of the following plays on a yellow, with the clock transitioning to injury time. I ran to the bench, got water, tightened my shoes and ran to the half-field line ready to return.</li>\n<li>\n<strong><em>(See cover photo) </em></strong>Begging to go back in, I never made it. Another goal was scored, and so I remained. The last picture ever taken of me in my high school career is me standing on that line, just waiting, watching, while I started to cry. It was hard for me to realize it was all over, and it was even harder to accept I wasn’t on the field as it ended. Those last few minutes, everything felt surreal; it was quiet, no longer cold, the pain from the hits I took were alleviated, as my entire career flashed before my eyes. Every time I look at that picture, I feel no remorse, but amazing pride and joy in what I was able to accomplish in a few seasons with some of my greatest friends, partaking in the greatest game ever played.</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/640/1*nxmJq1algAKEDfR5MA1Y0w.jpeg\"><figcaption>Senior Night with Family and Coaches</figcaption></figure><p>Here is a picture from my senior night with (from left to right) with Fabs and the assistant coaches, Adam Moss, (my parents), Matt Schactel, and Dan Jamnick. I wanted to highlight them because of their amazing support and commitment to our development on and off the field. In fact, Dan actually helped me get my first internship. A few years later he helped me on the legal side with my startup company, saving me a ton of money and yielding me a great deal of real world business experience that I would have otherwise paid someone to do. But he wasn’t doing it for the money, and he didn’t have to do it at all, but he is a real genuine guy and I am very grateful for having him and all of them in in my life. They are all still amazing resources and maintain interest in our success. This is yet another example of how soccer brings out the best in people.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*CzJnjJU5zosJyCkfZT_26g.jpeg\"><figcaption>NJ Scholar Athlete Awards</figcaption></figure><p>On the side, I was also quite into my academics. I was involved with my soccer both on the field and off. I helped my teammates with homework, fitness, and nutrition because i knew so much about it at this point, and other things that I had knowledge or expertise with. All this combined led to me winning the New Jersey State Scholar Athlete Award, given to only one individual per high school from any sport and either gender. This was very humbling in that my extra work and dedication didn’t go unrecognized.</p>\n<p>With growing confidence, I decided to try out for what was the best team I would become a part of up to that time. The jump in skill was exponential, and although I was getting better, I needed someone on my side. The assistant coach at the time was Fred Rodrigo. He was a true believer in me and proved to be a very influential man in my soccer career. He pushed me and really supported me, which I needed. He refused to let me give in during the few weeks I was trying out. I was a practice player, and eventually made it on the roster. I didn’t play for a while, but Fred always recommended to the head coach to give me a shot. A few more weeks went by, and eventually I got my shot. Fred made an executive decision with a few minutes left in the first half to give another player a rest who was becoming winded. I went in, and after just a few minutes, I officially started my season with a great assist.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/720/1*DIgwDfHksETfwtWQN2SfhA.jpeg\"><figcaption>The ISC Fury</figcaption></figure><p>Fred made sure that I kept momentum. I grew and matured as a player and greatly enjoyed my time with Fred and the team. But not all great things can last. Politics, players leaving, and other issues arose, negatively impacting the dynamic of the team. We nearly folded as a team, but the bond that Fred and I built would help me move on to the next chapter. He took me with him to another team, where I would be afforded a new set of amazing cultural experiences.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/133/1*y1szX5tVWyRBJlZoOxfSFA.jpeg\"><figcaption>Fred Rodrigo</figcaption></figure><p>This team was The Den of Lions, also from Newark, NJ. This was very unique experience for me, as in the past I had been in homogenous (all caucasian) teams, to find myself as the token caucasian on the team. On average, a majority of the players came from less fortunate economic backgrounds. Many of them lived with only a single parent, if one at all. They didn’t have the newest or most expensive gear, but I quickly learned it was not about the money, it was the opposite. In my previous article I thought the cleats made the player, but in some of these instances, my teammates with cheapest, oldest, most worn out boots were the best on the team.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*EmaEA0bN0D5ZF90iJSWSDw.jpeg\"><figcaption>Den of Lions</figcaption></figure><p>I learned humility and morals, and embraced the feeling of inclusion they provided for me. Yes, there was a language barrier, but we overcame it together. Unable to pronounce “Tyler,” they resorted to “Taylor,” until finally “Tito” stuck. I become one of them, and we learned and grew together, teaching each other about our respective cultures. We competed in state and national tournament, spending a lot of time together on and off the field, which made us grow closer. It was like all our troubles went away when we laced up and stepped on the field. From amazing victories through harsh defeat, I wouldn’t trade those memories for the world. At the end of the day, it was all for <em>our</em> love the game.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*XUJOPUxO6QxjV8OoGuKj3Q.jpeg\"></figure><p>Soccer is more than just a game or sport. It is truly a unifying activity that brings people together from so vastly different backgrounds. In the soccer world, there is one big family. From the saying “Real recognize real,” well I say “soccer players [recognize] soccer players,” and recognize is not meant to be passive, but rather be associated with welcoming and embracing. This is to represent the unique bond we share compared to other sports. It is pretty easy for us to spot each other from a mile away, which is why pickup games are anywhere and anytime. A new team forms and it is amazing how quickly chemistry can stir as if the players had spent hours practicing.</p>\n<p>Overall, I really owe a lot to soccer. Good health, great friends, lasting memories, worldly cultural awareness. Soccer will always represent a family I can lean on that is ever expanding. It will always be a huge part of my life and it will always be the greatest game ever played.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ba1012b4f363\" width=\"1\" height=\"1\">\n",
            "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*IujU4AbX5PhIKKX101v-HA.jpeg\"><figcaption>The Last Picture</figcaption></figure><h3>4 — The Camaraderie, Culture, and Beauty of Soccer</h3>\n<p><strong><em>preface: </em></strong><em>Given the nature of this series, spanning the last 11 years of my life (chronologically), I will be writing each story in first-person as if I was writing at that age.</em></p>\n<p><strong>ages:</strong> 10–16 <em>(but truly very young-to hopefully the rest of my life)</em></p>\n<p>Following up after my last article, I cannot say enough how much soccer is an important part of my life. It was my first team sport that I started from a young age. I was eventually coached by my father, who traveled all over, posting flyers, articles, etc. trying to recruit players to our team. Our team was very unique because of this, which started a trend of diversity throughout my soccer career.</p>\n<p>As time went on I played for each school team in addition to my town’s team. Unfortunately, I was quite inhibited by my (over)weight. I was slow, had low endurance, and as a result was eventually pressured to transition to goalie. The saying was, “someone had to do it,” and it made the most sense given my physical status at the time.</p>\n<p>I aspired to be a field player, which was another huge motivator as mentioned in previous article. I refused to be held back from my potential and desire. In addition working out and eating better, I thought what better way to get in shape for soccer then to take every opportunity I had to actually play. Not only did this make me better, it improved self esteem in that i could achieve what I wanted.</p>\n<p>With these new abilities, I found confidence and started trying out for teams. Season after season I moved up and up; year after year the teams I joined were better and better. This was rated first by better towns, then by better counties, then eventually clubs and premier teams, competing at the state level.</p>\n<p>Going into high school and preparing to tryout for the most advanced team I would join, I needed to be in tip-top shape. Thankfully, one day my mother was walking around the track when she was passed by a runner flying by at lightning speed. She thought nothing of it, until it happened a few more times. He stopped stretch on the side, and my mother approached him, asking who he was and why he was there.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/1*QWql6NqCUA50sN0-J2Ybxg.jpeg\"><figcaption>Dayon Cobbs</figcaption></figure><p>The man’s name was Dayon. He was a fireman out of Newark, NJ, training for the World Police and Fire Games, wherein he was on a sprinting relay team. Astonished, she asked him to become my trainer. He explained to her that he had never trained anyone before and he didn’t feel comfortable even after my mother offered to pay. He was very reluctant, but my 5-foot tall mother hounded him and wouldn’t take no for answer. Sure enough, no matter how tough he was, he conceded and became my trainer.</p>\n<p>Given that I was guinea pig for what would become a new side gig of his, he thought what better way to start then the most obvious: follow his routine. Dayon was a well conditioned college track athlete and now fireman. He pushed me way beyond my limit, and the more I hated it, the more I loved it. A little discouraged, I asked him after a few weeks, “Dayon, how do I know if I am making progress if I am always behind and chasing you?” His smart-ass remark, “when I start chasing you” was all I needed to continue. Although I never caught him, I owe a great deal to Dayon who taught me a lot on and off the track. He was extremely humble and wise, which was a true motivator and proved wonders.</p>\n<p>I eventually made varsity, proceeding up through captain and receiving state nominations. Year after year as the competition got better, so too did I. When of the biggest traits I had to offer was that I was always there and <em>clutch</em> when I was needed the most.</p>\n<p><strong>Sophomore year:</strong></p>\n<ul><li>For example, on the way to States sophomore year, I took my first ever penalty kick in a shootout. Fortunately I made it (It would have been better if it was my last though).</li></ul>\n<p><strong>Junior Year:</strong></p>\n<ul><li>The following year, around the same time in the season, we played against a team we never beat in history, who was destined to win yet again, claiming their 25th state championship. I was coming off an injury from the previous game, and almost didn’t play. However I suited up and gave everything I had. There was a weak clearance from the defender off our corner kick, and some 30 yards out the ball caressed my chest, bounced off the floor, and led by my boot, with such force and spin, defied the laws of physics, bending from the middle of the field to the top right corner of the goal. The opposing team’s fans went silent as their jaws dropped, along with mine as I and the stadium was left in awe. I’ve never been able to recreate that shot, and I selfishly hope it never does, for it was a statement and legacy I left on that field.</li></ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*087QvzkTzBrK_lXUGb_GIQ.jpeg\"><figcaption>Giving one of my pre-game Speeches</figcaption></figure><p><strong>Senior Year:</strong></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*AQ5kVHIYI4ESxeKAcv-KNA.jpeg\"><figcaption>Coach Fabs</figcaption></figure><ul>\n<li>Clutch was one adjective I appreciated, along with adaptable. Four games into the season, our chemistry was off and we needed a change. On the 5th game, when conference matches would start, the unthinkable happened. We were in the huddle with good old Fabiano, the longest running soccer coach in history. On a side note, he has lasted so long because of his good eating habits and strong core; he would run the field workouts and perform better or equal to our most athletic players. Anyway, we were in the huddle, and Fabs gave us the talk followed by the line up that had been the same for the previous 4 games in addition to pre-season. He switched myself at Center-Midfield to Center-Back with another player. Assuming it was a mistake, the other player and I looked at each other and then at Fabs, and inquired what we just knew to be incorrect. He said, I will give the line up again, and he did, with the same mistake.</li>\n<li>This moment was set up to be either the turning point or downfall of our season, as he put two of the top players in flipped positions they were unfamiliar with. Within three games, our chemistry sky-rocketed. Whether intentional or luck, Fabs figured it out. I asked him one day which it was, and he told me that it was luck, however, it was inspired by his intuition, which then came from his good coaching skills… and then he summarized, “You have to be good in order to be lucky.” Man I took that to heart, and what a placebo axiom it was! Nevertheless I went on to having my best season, accusing many accolades and earning the title the “Rock at the Back.”</li>\n<li>Marching to states we beat some great teams along the way. Entering the semi’s against we were set to face our hated rival. They were favored to win, and sure enough the refs were even from their town. This second part proved harmful because we couldn’t catch a break on anything–they were against us and used their authority to prove it, dishing out warnings and yellow cards like fliers. The game was at their home field in 20 degree weather, still snowing.</li>\n<li>In high school, the halves are 40 minutes long, so keep this mind throughout the following calculations. During the first half there were 7 minutes of added time to injuries and disputes. After those 47 minutes, the game was scoreless. The second half proceed, and 15 minutes in, one of our players received a second yellow, which turned to red, leaving us a man down. Now we were 62 minutes in and a man down with 25 minutes left in regulation. The score remained the same for the next 20 or so minutes. It wasn’t until 82 minutes and only 3 left in regulation, we conceded a free kick, resulting in the first goal. I was sent off in one of the following plays on a yellow, with the clock transitioning to injury time. I ran to the bench, got water, tightened my shoes and ran to the half-field line ready to return.</li>\n<li>\n<strong><em>(See cover photo) </em></strong>Begging to go back in, I never made it. Another goal was scored, and so I remained. The last picture ever taken of me in my high school career is me standing on that line, just waiting, watching, while I started to cry. It was hard for me to realize it was all over, and it was even harder to accept I wasn’t on the field as it ended. Those last few minutes, everything felt surreal; it was quiet, no longer cold, the pain from the hits I took were alleviated, as my entire career flashed before my eyes. Every time I look at that picture, I feel no remorse, but amazing pride and joy in what I was able to accomplish in a few seasons with some of my greatest friends, partaking in the greatest game ever played.</li>\n</ul>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/640/1*nxmJq1algAKEDfR5MA1Y0w.jpeg\"><figcaption>Senior Night with Family and Coaches</figcaption></figure><p>Here is a picture from my senior night with (from left to right) with Fabs and the assistant coaches, Adam Moss, (my parents), Matt Schactel, and Dan Jamnick. I wanted to highlight them because of their amazing support and commitment to our development on and off the field. In fact, Dan actually helped me get my first internship. A few years later he helped me on the legal side with my startup company, saving me a ton of money and yielding me a great deal of real world business experience that I would have otherwise paid someone to do. But he wasn’t doing it for the money, and he didn’t have to do it at all, but he is a real genuine guy and I am very grateful for having him and all of them in in my life. They are all still amazing resources and maintain interest in our success. This is yet another example of how soccer brings out the best in people.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*CzJnjJU5zosJyCkfZT_26g.jpeg\"><figcaption>NJ Scholar Athlete Awards</figcaption></figure><p>On the side, I was also quite into my academics. I was involved with my soccer both on the field and off. I helped my teammates with homework, fitness, and nutrition because i knew so much about it at this point, and other things that I had knowledge or expertise with. All this combined led to me winning the New Jersey State Scholar Athlete Award, given to only one individual per high school from any sport and either gender. This was very humbling in that my extra work and dedication didn’t go unrecognized.</p>\n<p>With growing confidence, I decided to try out for what was the best team I would become a part of up to that time. The jump in skill was exponential, and although I was getting better, I needed someone on my side. The assistant coach at the time was Fred Rodrigo. He was a true believer in me and proved to be a very influential man in my soccer career. He pushed me and really supported me, which I needed. He refused to let me give in during the few weeks I was trying out. I was a practice player, and eventually made it on the roster. I didn’t play for a while, but Fred always recommended to the head coach to give me a shot. A few more weeks went by, and eventually I got my shot. Fred made an executive decision with a few minutes left in the first half to give another player a rest who was becoming winded. I went in, and after just a few minutes, I officially started my season with a great assist.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/720/1*DIgwDfHksETfwtWQN2SfhA.jpeg\"><figcaption>The ISC Fury</figcaption></figure><p>Fred made sure that I kept momentum. I grew and matured as a player and greatly enjoyed my time with Fred and the team. But not all great things can last. Politics, players leaving, and other issues arose, negatively impacting the dynamic of the team. We nearly folded as a team, but the bond that Fred and I built would help me move on to the next chapter. He took me with him to another team, where I would be afforded a new set of amazing cultural experiences.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/133/1*y1szX5tVWyRBJlZoOxfSFA.jpeg\"><figcaption>Fred Rodrigo</figcaption></figure><p>This team was The Den of Lions, also from Newark, NJ. This was very unique experience for me, as in the past I had been in homogenous (all caucasian) teams, to find myself as the token caucasian on the team. On average, a majority of the players came from less fortunate economic backgrounds. Many of them lived with only a single parent, if one at all. They didn’t have the newest or most expensive gear, but I quickly learned it was not about the money, it was the opposite. In my previous article I thought the cleats made the player, but in some of these instances, my teammates with cheapest, oldest, most worn out boots were the best on the team.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*EmaEA0bN0D5ZF90iJSWSDw.jpeg\"><figcaption>Den of Lions</figcaption></figure><p>I learned humility and morals, and embraced the feeling of inclusion they provided for me. Yes, there was a language barrier, but we overcame it together. Unable to pronounce “Tyler,” they resorted to “Taylor,” until finally “Tito” stuck. I become one of them, and we learned and grew together, teaching each other about our respective cultures. We competed in state and national tournament, spending a lot of time together on and off the field, which made us grow closer. It was like all our troubles went away when we laced up and stepped on the field. From amazing victories through harsh defeat, I wouldn’t trade those memories for the world. At the end of the day, it was all for <em>our</em> love the game.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/960/1*XUJOPUxO6QxjV8OoGuKj3Q.jpeg\"></figure><p>Soccer is more than just a game or sport. It is truly a unifying activity that brings people together from so vastly different backgrounds. In the soccer world, there is one big family. From the saying “Real recognize real,” well I say “soccer players [recognize] soccer players,” and recognize is not meant to be passive, but rather be associated with welcoming and embracing. This is to represent the unique bond we share compared to other sports. It is pretty easy for us to spot each other from a mile away, which is why pickup games are anywhere and anytime. A new team forms and it is amazing how quickly chemistry can stir as if the players had spent hours practicing.</p>\n<p>Overall, I really owe a lot to soccer. Good health, great friends, lasting memories, worldly cultural awareness. Soccer will always represent a family I can lean on that is ever expanding. It will always be a huge part of my life and it will always be the greatest game ever played.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ba1012b4f363\" width=\"1\" height=\"1\">\n",
            "enclosure": {},
            "categories": [
                "soccer",
                "sports",
                "culture",
                "family"
            ]
        },
        {
            "title": "3 — The Entry Opportunities For (Youthful) Entrepreneurship and Supply Chain Management",
            "pubDate": "2018-01-13 21:49:47",
            "link": "https://medium.com/@tylercitrin/the-entry-opportunities-for-youthful-entrepreneurship-and-supply-chain-management-370ea9e659e9?source=rss-28ed505e83f3------2",
            "guid": "https://medium.com/p/370ea9e659e9",
            "author": "Tyler Citrin",
            "thumbnail": "https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=370ea9e659e9",
            "description": "\n<h3>3 — The Entry Opportunities For (Youthful) Entrepreneurship through the Soccer Supply Chain</h3>\n<p>I am the son of a… businessman, and so was my father, so you could say its in my blood. My grandfather immigrated (and escaped) during the first World War and started a clothing company. My father was a salesman of all sorts, acquiring a great set of skills and business acumen along the way. He is also extremely clever, and truly embodied the title of a “wheeler and dealer,” all of which he fortunately passed onto me.</p>\n<p>I wanted to enter the business realm, and I looked to my passion to do so. Soccer was (and still is) a huge part of my life (to be discussed in the next article), which presented with me a great opportunity. Just as sneaker-heads collect the obvious, sneakers, the more soccer took over my life, the more I became a “(soccer) cleat-head.” There was such a wide variety of cleats, from the simple classics, all the way to the flashy high-tech modern boots, spanning the entire color spectrum. Not only did I want to acquire them as collectables, I also had this conviction that the better and more expensive cleats I bought, the better player I could become. Clearly, this proved to be a true placebo affect, but it was a positive feeling and belief that others shared as well, and thus demonstrated potential for monetization: offer people the cleats they want at a price they can afford.</p>\n<p>This led to the research phase of my first endeavor. I knew I needed to select a target audience, identify suppliers, and then locate their middlemen. In 2011, I spent about two months trying to figure this out. The first one was easy — it was anyone that played soccer. Originally, I thought to solely focus on those coming from a higher wealth class, and then pivot from there if necessary. The goal was simple: maximize profit, first by sales price, then by sales volume. Through research and many conversations, I learned how to pinpoint the best price-point through an ingenious economic strategy (I thought) I created: <em>price discrimination </em>or <em>first-degree price differentiation.</em> What this translated to is “sell the same product to different people at the most they are willing to pay.” Regardless, with this feat at age 13, I was pretty proud of myself.</p>\n<p>The second of the three tasks was where I spent most of my time, until I finally met a woman named Tina who worked at a distribution center at a company called Alibaba, and I was extremely skeptical. Nevertheless, I asked my mother for an initial investment slash loan, because I was not 100% convinced my plan would work, and at 13 did not have much to gamble. I told her if it worked out, I would give her a 100% return, and if not, it would be next year’s birthday present. So I spent days of back and forth communication with good old Tina, vetting everything I saw fit. Then I decided now that with the seed funding I raised, that is less than $100 from my mother, but a fortune to someone at that age, I would commit my first purchase. Days turned into weeks, but low and behold, the first pair came.</p>\n<p>My campaign began: I posted all over social media, I messaged my entire network of soccer friends and received tons of inquires. Order after order, I learned more and more about the customers, and more and more about how I could squeeze further Tina. She started to throw in gifts, give deals, and incentivize me with bulk orders. The more we transacted, the more trust we built, which was very important. Word was spreading fast, and I needed to order surplus inventory because I couldn’t keep up with demand. This forecasting was very difficult and I had to conduct analysis of what I ordered, what was popular, size, color, shape, etc. I learned a lot here about trend analysis, but also how to convince people of trends they didn’t realize. Sometimes I would have rather taken a smaller profit margin on a sale to speed up inventory turnover instead of order more.</p>\n<p>Eventually sales slowed because I was running out of customers and refused to pay for inorganic advertising, so I tried to figure out how to move forward. Either people already bought cleats, had enough cleats, or did not have enough money to buy more. I found a way to pivot: I looked into profiting on trading, refurbishing, and recycling. I reached out to all the potential reluctant buyers and exhausted all of the possible trades I could make. Trading helped me acquire rare cleats or worn cleats which I was able to refurbish and resell or recycle. I even kept some rare ones on my own. But I hit the same road block and once again ran out of customers.</p>\n<p>I turned back to social media and got in a very small group called “Buying, selling and trading cleats” on Facebook, and that is exactly what we did. The incentive was to expand the group: the more people in the group, the more possibilities of exchanges of any sort. It grew and grew as I invited more people, eventually to a few thousand. I even gave people discounts for adding all of their known soccer peers.</p>\n<p>[added below paragraphs]</p>\n<p>I actually met a friend on that Facebook page who would later become a business partner, so to speak. We connected over a pair of special edition mercurial vapors. The issue was he lived in New York and only had means for a cash transaction. It was 8th grade, and fortunately in the next two weeks we were going to New York for a day trip. I sat at the back of the bus with my bag of cleats, “ready to make the drop.” One by one we got off and were accounted for, so they thought. I veered off into an alley, made the trade, and the trust was established.</p>\n<p>We tried to create a formalized website later called “Second Leg Soccer,” kind of like second hand, so hopefully you get the idea. It really didn’t go anywhere, at all in fact. But it was a fun go at web design and setting up my first official partnership / business.</p>\n<p>[end addition]</p>\n<p>All went well for a while, but I eventually I got busy with school. I was able to walk away with a vast set of valuable learning experiences and life lessons about marketing, supply chain management, economics, and negotiations, among many others. I hope you enjoyed my business experience afforded to me through soccer and I hope you get to read my next article about my other experiences while actually playing!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=370ea9e659e9\" width=\"1\" height=\"1\">\n",
            "content": "\n<h3>3 — The Entry Opportunities For (Youthful) Entrepreneurship through the Soccer Supply Chain</h3>\n<p>I am the son of a… businessman, and so was my father, so you could say its in my blood. My grandfather immigrated (and escaped) during the first World War and started a clothing company. My father was a salesman of all sorts, acquiring a great set of skills and business acumen along the way. He is also extremely clever, and truly embodied the title of a “wheeler and dealer,” all of which he fortunately passed onto me.</p>\n<p>I wanted to enter the business realm, and I looked to my passion to do so. Soccer was (and still is) a huge part of my life (to be discussed in the next article), which presented with me a great opportunity. Just as sneaker-heads collect the obvious, sneakers, the more soccer took over my life, the more I became a “(soccer) cleat-head.” There was such a wide variety of cleats, from the simple classics, all the way to the flashy high-tech modern boots, spanning the entire color spectrum. Not only did I want to acquire them as collectables, I also had this conviction that the better and more expensive cleats I bought, the better player I could become. Clearly, this proved to be a true placebo affect, but it was a positive feeling and belief that others shared as well, and thus demonstrated potential for monetization: offer people the cleats they want at a price they can afford.</p>\n<p>This led to the research phase of my first endeavor. I knew I needed to select a target audience, identify suppliers, and then locate their middlemen. In 2011, I spent about two months trying to figure this out. The first one was easy — it was anyone that played soccer. Originally, I thought to solely focus on those coming from a higher wealth class, and then pivot from there if necessary. The goal was simple: maximize profit, first by sales price, then by sales volume. Through research and many conversations, I learned how to pinpoint the best price-point through an ingenious economic strategy (I thought) I created: <em>price discrimination </em>or <em>first-degree price differentiation.</em> What this translated to is “sell the same product to different people at the most they are willing to pay.” Regardless, with this feat at age 13, I was pretty proud of myself.</p>\n<p>The second of the three tasks was where I spent most of my time, until I finally met a woman named Tina who worked at a distribution center at a company called Alibaba, and I was extremely skeptical. Nevertheless, I asked my mother for an initial investment slash loan, because I was not 100% convinced my plan would work, and at 13 did not have much to gamble. I told her if it worked out, I would give her a 100% return, and if not, it would be next year’s birthday present. So I spent days of back and forth communication with good old Tina, vetting everything I saw fit. Then I decided now that with the seed funding I raised, that is less than $100 from my mother, but a fortune to someone at that age, I would commit my first purchase. Days turned into weeks, but low and behold, the first pair came.</p>\n<p>My campaign began: I posted all over social media, I messaged my entire network of soccer friends and received tons of inquires. Order after order, I learned more and more about the customers, and more and more about how I could squeeze further Tina. She started to throw in gifts, give deals, and incentivize me with bulk orders. The more we transacted, the more trust we built, which was very important. Word was spreading fast, and I needed to order surplus inventory because I couldn’t keep up with demand. This forecasting was very difficult and I had to conduct analysis of what I ordered, what was popular, size, color, shape, etc. I learned a lot here about trend analysis, but also how to convince people of trends they didn’t realize. Sometimes I would have rather taken a smaller profit margin on a sale to speed up inventory turnover instead of order more.</p>\n<p>Eventually sales slowed because I was running out of customers and refused to pay for inorganic advertising, so I tried to figure out how to move forward. Either people already bought cleats, had enough cleats, or did not have enough money to buy more. I found a way to pivot: I looked into profiting on trading, refurbishing, and recycling. I reached out to all the potential reluctant buyers and exhausted all of the possible trades I could make. Trading helped me acquire rare cleats or worn cleats which I was able to refurbish and resell or recycle. I even kept some rare ones on my own. But I hit the same road block and once again ran out of customers.</p>\n<p>I turned back to social media and got in a very small group called “Buying, selling and trading cleats” on Facebook, and that is exactly what we did. The incentive was to expand the group: the more people in the group, the more possibilities of exchanges of any sort. It grew and grew as I invited more people, eventually to a few thousand. I even gave people discounts for adding all of their known soccer peers.</p>\n<p>[added below paragraphs]</p>\n<p>I actually met a friend on that Facebook page who would later become a business partner, so to speak. We connected over a pair of special edition mercurial vapors. The issue was he lived in New York and only had means for a cash transaction. It was 8th grade, and fortunately in the next two weeks we were going to New York for a day trip. I sat at the back of the bus with my bag of cleats, “ready to make the drop.” One by one we got off and were accounted for, so they thought. I veered off into an alley, made the trade, and the trust was established.</p>\n<p>We tried to create a formalized website later called “Second Leg Soccer,” kind of like second hand, so hopefully you get the idea. It really didn’t go anywhere, at all in fact. But it was a fun go at web design and setting up my first official partnership / business.</p>\n<p>[end addition]</p>\n<p>All went well for a while, but I eventually I got busy with school. I was able to walk away with a vast set of valuable learning experiences and life lessons about marketing, supply chain management, economics, and negotiations, among many others. I hope you enjoyed my business experience afforded to me through soccer and I hope you get to read my next article about my other experiences while actually playing!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=370ea9e659e9\" width=\"1\" height=\"1\">\n",
            "enclosure": {},
            "categories": [
                "startup",
                "soccer",
                "entrepreneurship",
                "life",
                "economics"
            ]
        },
        {
            "title": "2 - The Importance of Physical Fitness and Nutrition",
            "pubDate": "2018-01-05 15:42:44",
            "link": "https://medium.com/@tylercitrin/2-the-importance-of-physical-fitness-and-nutrition-8e502b290617?source=rss-28ed505e83f3------2",
            "guid": "https://medium.com/p/8e502b290617",
            "author": "Tyler Citrin",
            "thumbnail": "https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=8e502b290617",
            "description": "\n<p><strong><em>preface: </em></strong><em>Given the nature of this series, spanning the last 11 years of my life (chronologically), I will be writing each story in first-person as if I was writing at that age.</em></p>\n<p><strong>ages:</strong> 10–14</p>\n<p>I was not blessed with superior athletic genetics. My height leveled off earlier towards the end of sixth grade, but my weight did not. In my family, we believed that you should “eat what you want if it makes you happy.” I took this to heart, and boy was I happy, for a while. Between going out (for fast food) or snacking (on junk food), I never had to worry about my “macros” or my my daily exercise.</p>\n<p>However, sure enough this caught up to me. I became overweight, which made me worse at soccer, which made me want to play less, which made me overweight, … and the cycle continued. I was only eleven years old or so, which is why perhaps why it took longer for me to recognize the dramatic changes. Some of these include sports and physical capabilities, mental sanity, social ostracization, psychological stability, just to name a few.</p>\n<p>Needless to say none of these changes were for the better, and contributed far more to my self-esteem because of my age. The longer it persisted, the worse it got, and the more friends disappeared. It was not my fault, that is, that these side effects occurred–I was just a kid and did not know any better. So eventually I became lonely, and that is when everything became more clear.</p>\n<p>It was a sad but harsh realization at now age twelve, when my best friend at that time made plans with my other friends, whom of which I introduced him too, without me, and gave me some b.s. excuse. It became very clear, that I was the only one that could help resolve my situation.</p>\n<p>Two things needed to change, first I needed to have better nutrition, and second, I needed to be in better physical shape. It was not solely because I “was out of shape” or “unhealthy,” it was because of all the (negative) combined side effects mentioned earlier. So I decided to utilize my time wisely and began to research, a lot. Every minute I <br>previously spent playing video games, which was a lot, I dedicated to learning anything and everything about fitness and nutrition… for about 6 months.</p>\n<p>At age 13, the research efforts then translated into actions–I cleaned my house of all junk food and told my mother to no longer buy it. I then purchased a gym membership and crafted a workout regiment after watching documentaries on Arnold Schwarzenegger. I was ready to go, and so I did.</p>\n<p>Every day for three months, my research continued, my training continued, and the cycle goes on. I had so much free time, endless you could say; I was thirteen, in the summer, not working, and not many friends. Over the course of that summer I underwent a complete transformation. I lost ten pounds, gained half of it back through muscle, shaved <br>my head, cleaned up my hygiene, and wore a smile at all times. I had an aurora of positivity. My self-esteem was at an all time high; I was confident with school, women, sports (which I will focus on in the next article).</p>\n<p>The most important thing I learned throughout this journey is that no matter how many changes my body went through, how many friends came and went, how much society evolved around me during the cruelties of middle school, I never changed as a person.</p>\n<p>I made a vow to myself at the beginning that I would never return to this rock-bottom state, but that I would also never digress and stay true to my morals and beliefs, and some ten years later I have kept that promise.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=8e502b290617\" width=\"1\" height=\"1\">\n",
            "content": "\n<p><strong><em>preface: </em></strong><em>Given the nature of this series, spanning the last 11 years of my life (chronologically), I will be writing each story in first-person as if I was writing at that age.</em></p>\n<p><strong>ages:</strong> 10–14</p>\n<p>I was not blessed with superior athletic genetics. My height leveled off earlier towards the end of sixth grade, but my weight did not. In my family, we believed that you should “eat what you want if it makes you happy.” I took this to heart, and boy was I happy, for a while. Between going out (for fast food) or snacking (on junk food), I never had to worry about my “macros” or my my daily exercise.</p>\n<p>However, sure enough this caught up to me. I became overweight, which made me worse at soccer, which made me want to play less, which made me overweight, … and the cycle continued. I was only eleven years old or so, which is why perhaps why it took longer for me to recognize the dramatic changes. Some of these include sports and physical capabilities, mental sanity, social ostracization, psychological stability, just to name a few.</p>\n<p>Needless to say none of these changes were for the better, and contributed far more to my self-esteem because of my age. The longer it persisted, the worse it got, and the more friends disappeared. It was not my fault, that is, that these side effects occurred–I was just a kid and did not know any better. So eventually I became lonely, and that is when everything became more clear.</p>\n<p>It was a sad but harsh realization at now age twelve, when my best friend at that time made plans with my other friends, whom of which I introduced him too, without me, and gave me some b.s. excuse. It became very clear, that I was the only one that could help resolve my situation.</p>\n<p>Two things needed to change, first I needed to have better nutrition, and second, I needed to be in better physical shape. It was not solely because I “was out of shape” or “unhealthy,” it was because of all the (negative) combined side effects mentioned earlier. So I decided to utilize my time wisely and began to research, a lot. Every minute I <br>previously spent playing video games, which was a lot, I dedicated to learning anything and everything about fitness and nutrition… for about 6 months.</p>\n<p>At age 13, the research efforts then translated into actions–I cleaned my house of all junk food and told my mother to no longer buy it. I then purchased a gym membership and crafted a workout regiment after watching documentaries on Arnold Schwarzenegger. I was ready to go, and so I did.</p>\n<p>Every day for three months, my research continued, my training continued, and the cycle goes on. I had so much free time, endless you could say; I was thirteen, in the summer, not working, and not many friends. Over the course of that summer I underwent a complete transformation. I lost ten pounds, gained half of it back through muscle, shaved <br>my head, cleaned up my hygiene, and wore a smile at all times. I had an aurora of positivity. My self-esteem was at an all time high; I was confident with school, women, sports (which I will focus on in the next article).</p>\n<p>The most important thing I learned throughout this journey is that no matter how many changes my body went through, how many friends came and went, how much society evolved around me during the cruelties of middle school, I never changed as a person.</p>\n<p>I made a vow to myself at the beginning that I would never return to this rock-bottom state, but that I would also never digress and stay true to my morals and beliefs, and some ten years later I have kept that promise.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=8e502b290617\" width=\"1\" height=\"1\">\n",
            "enclosure": {},
            "categories": [
                "health"
            ]
        },
        {
            "title": "1 — The Pertinence and Celebration of Family and Friends",
            "pubDate": "2018-01-03 15:40:44",
            "link": "https://medium.com/@tylercitrin/the-pertinence-and-celebration-of-family-and-friends-5de871f99af4?source=rss-28ed505e83f3------2",
            "guid": "https://medium.com/p/5de871f99af4",
            "author": "Tyler Citrin",
            "thumbnail": "https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=5de871f99af4",
            "description": "\n<p><strong><em>Preface: </em></strong><em>Given the nature of this series, spanning the last 11 years of my life (chronologically), I will be writing each story in first-person as if I was writing at that age.</em></p>\n<p><strong>Age(s): </strong>10–14</p>\n<p>I find truth in the belief that people are (initially, unless otherwise resistant) a product of their environment, largely shaped by the most important and frequent people in one’s life.</p>\n<p>For me, this was predominantly my grandparents. Spending a great deal of time with them, whether through dinners or family excursions, I became cultured by old style traditions. I looked up to them for all of their achievements and the wisdom they provided me with.</p>\n<p>One of my grandmother’s in particular lived with my family and for many years contributed a lot to my upbringing. Between making breakfast and getting me from school, we became very close, and it was sentiments like these that made me really value and appreciate relationships in life. However, it was not until the inevitable happened, that I would comprehend some of the harsh realities of life.</p>\n<p>The grandmother that was living with us was eventually moved into a nursing home, for reasons at that time I was not made privy to. we would visit her weekly, but the meetings would<strong> become shorter and shorter.</strong> One day I was provided with a choice, attend a soccer scrimmage or go see her. Presented these options, I chose the former, based on the simple notion that delaying my visit another week would be harmless.</p>\n<p>So I went to soccer, my family went on their visit without me and life went unchanged. Until the next visit, when my grandmother did not recognize me, giving me the cold shoulder as I if I was foreign to her, and the rest was inevitable. I shared this story to demonstrate that often a small sacrifice for family can be invaluable. I chose not to make the sacrifice, and had to suffer the consequences. At a young age, I turned to anger, but relied on my friends to keep me going.</p>\n<p>I had a core group of friends. Some came, some went, but the knowledge that there was always someone there when I needed them was the key factor. I found great joy in introducing a new friend into a group, or even one group to another. Time went on, and people changed, and I started to contemplate what true friendship was.</p>\n<p>I spent a lot of time alone, only accompanied by my own consciousness. Through this different lens I sought to gain a better understanding of what makes a good relationship of any type and why having them is so important. I was a silent observer, waiting until something gave me the courage and confidence to make real friends.</p>\n<p>I discovered with great difficulty, the ease of relationship building. At age 13 I realized that people love to talk about what they love to talk about. Genius! I thought, after only a year, I developed trust among a single core group of friends, because we found common ground that became the basis of our group unity. If you asked me back then to bet whether or not this would change, I would have taken you up on that. Ten years later and this is my same group of friends.</p>\n<p>Over the years we worked together to get through some tough times, and celebrate the good ones. Once I found this group, I made it my goal to never fall victim to “taking [them] for granted,” something I should have learned earlier on from the previous story. But this cliche is often reserved for older people looking back at their regrets. I do not have any regrets, only the celebration of people who have helped me become the man I am today.</p>\n<p>Thank you for taking the time to read a very personal post, see you next post!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=5de871f99af4\" width=\"1\" height=\"1\">\n",
            "content": "\n<p><strong><em>Preface: </em></strong><em>Given the nature of this series, spanning the last 11 years of my life (chronologically), I will be writing each story in first-person as if I was writing at that age.</em></p>\n<p><strong>Age(s): </strong>10–14</p>\n<p>I find truth in the belief that people are (initially, unless otherwise resistant) a product of their environment, largely shaped by the most important and frequent people in one’s life.</p>\n<p>For me, this was predominantly my grandparents. Spending a great deal of time with them, whether through dinners or family excursions, I became cultured by old style traditions. I looked up to them for all of their achievements and the wisdom they provided me with.</p>\n<p>One of my grandmother’s in particular lived with my family and for many years contributed a lot to my upbringing. Between making breakfast and getting me from school, we became very close, and it was sentiments like these that made me really value and appreciate relationships in life. However, it was not until the inevitable happened, that I would comprehend some of the harsh realities of life.</p>\n<p>The grandmother that was living with us was eventually moved into a nursing home, for reasons at that time I was not made privy to. we would visit her weekly, but the meetings would<strong> become shorter and shorter.</strong> One day I was provided with a choice, attend a soccer scrimmage or go see her. Presented these options, I chose the former, based on the simple notion that delaying my visit another week would be harmless.</p>\n<p>So I went to soccer, my family went on their visit without me and life went unchanged. Until the next visit, when my grandmother did not recognize me, giving me the cold shoulder as I if I was foreign to her, and the rest was inevitable. I shared this story to demonstrate that often a small sacrifice for family can be invaluable. I chose not to make the sacrifice, and had to suffer the consequences. At a young age, I turned to anger, but relied on my friends to keep me going.</p>\n<p>I had a core group of friends. Some came, some went, but the knowledge that there was always someone there when I needed them was the key factor. I found great joy in introducing a new friend into a group, or even one group to another. Time went on, and people changed, and I started to contemplate what true friendship was.</p>\n<p>I spent a lot of time alone, only accompanied by my own consciousness. Through this different lens I sought to gain a better understanding of what makes a good relationship of any type and why having them is so important. I was a silent observer, waiting until something gave me the courage and confidence to make real friends.</p>\n<p>I discovered with great difficulty, the ease of relationship building. At age 13 I realized that people love to talk about what they love to talk about. Genius! I thought, after only a year, I developed trust among a single core group of friends, because we found common ground that became the basis of our group unity. If you asked me back then to bet whether or not this would change, I would have taken you up on that. Ten years later and this is my same group of friends.</p>\n<p>Over the years we worked together to get through some tough times, and celebrate the good ones. Once I found this group, I made it my goal to never fall victim to “taking [them] for granted,” something I should have learned earlier on from the previous story. But this cliche is often reserved for older people looking back at their regrets. I do not have any regrets, only the celebration of people who have helped me become the man I am today.</p>\n<p>Thank you for taking the time to read a very personal post, see you next post!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=5de871f99af4\" width=\"1\" height=\"1\">\n",
            "enclosure": {},
            "categories": [
                "friendship",
                "relationships",
                "family",
                "life"
            ]
        },
        {
            "title": "0 — Personal Development Series: events and adversities that defined me over the years",
            "pubDate": "2017-12-25 14:16:08",
            "link": "https://medium.com/@tylercitrin/personal-development-series-events-and-adversities-that-defined-me-over-the-years-e7bf8459690b?source=rss-28ed505e83f3------2",
            "guid": "https://medium.com/p/e7bf8459690b",
            "author": "Tyler Citrin",
            "thumbnail": "https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=e7bf8459690b",
            "description": "\n<p>I have been prolonging the urge to type my thoughts, of which I dwell over when I am restless, and felt inspired by the relaxing holiday spirit to begin.</p>\n<p>When I was younger, a sub-series of events (to be discussed later), made sharing stories with others an uncomfortable task for years to come. I was quite a hypocrite, always encouraging others to open up to me, but never had the courage to do so myself.</p>\n<p>Only more recently, have I found the power in release and conversation, and the importance of simply hearing your own thoughts.</p>\n<p>I am a creature of habit, and will do my best to make writing one. My primary objectives with writing going forward are to become a more effective communicator and allow my thoughts to persist on paper. An additional benefit is to hopefully provide some insight and provoke some conversation with people who can relate or who are curious.</p>\n<p><strong>Here is a tentative overview (in chronological order) of this series, which I will update here accordingly:</strong></p>\n<ul>\n<li>The Pertinence And Celebration Of Family And Friends</li>\n<li>The Importance Of Physical Fitness And Nutrition</li>\n<li>The Entry Opportunities For (Youthful) Entrepreneurship and Supply Chain Management</li>\n<li>The Camaraderie, Culture, and Beauty of Soccer</li>\n<li>The Long-Term Benefits Of A Positive Work Ethic (From A Young Age)</li>\n<li>The Reality Of Choosing The “Right” College</li>\n<li>The Most Effective Ways To Spend Your College Career</li>\n<li>The Wrong Way To Do Entrepreneurship In College</li>\n<li>The Right Way To Do Entrepreneurship In College</li>\n<li>The Best Major(s) To Choose From</li>\n<li>The Value In Real, Committed Relationships Of All Degrees</li>\n<li>The Good Habits To Keep And The Bad Toxins To Get Rid Of</li>\n</ul>\n<p>These will keep me busy for a while, but as promised I will update here and always am looking for suggestions, especially if you know me, regarding anything you would like me to write about!</p>\n<p>Thank you for taking the time to read my initial post and I plan to share more soon!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=e7bf8459690b\" width=\"1\" height=\"1\">\n",
            "content": "\n<p>I have been prolonging the urge to type my thoughts, of which I dwell over when I am restless, and felt inspired by the relaxing holiday spirit to begin.</p>\n<p>When I was younger, a sub-series of events (to be discussed later), made sharing stories with others an uncomfortable task for years to come. I was quite a hypocrite, always encouraging others to open up to me, but never had the courage to do so myself.</p>\n<p>Only more recently, have I found the power in release and conversation, and the importance of simply hearing your own thoughts.</p>\n<p>I am a creature of habit, and will do my best to make writing one. My primary objectives with writing going forward are to become a more effective communicator and allow my thoughts to persist on paper. An additional benefit is to hopefully provide some insight and provoke some conversation with people who can relate or who are curious.</p>\n<p><strong>Here is a tentative overview (in chronological order) of this series, which I will update here accordingly:</strong></p>\n<ul>\n<li>The Pertinence And Celebration Of Family And Friends</li>\n<li>The Importance Of Physical Fitness And Nutrition</li>\n<li>The Entry Opportunities For (Youthful) Entrepreneurship and Supply Chain Management</li>\n<li>The Camaraderie, Culture, and Beauty of Soccer</li>\n<li>The Long-Term Benefits Of A Positive Work Ethic (From A Young Age)</li>\n<li>The Reality Of Choosing The “Right” College</li>\n<li>The Most Effective Ways To Spend Your College Career</li>\n<li>The Wrong Way To Do Entrepreneurship In College</li>\n<li>The Right Way To Do Entrepreneurship In College</li>\n<li>The Best Major(s) To Choose From</li>\n<li>The Value In Real, Committed Relationships Of All Degrees</li>\n<li>The Good Habits To Keep And The Bad Toxins To Get Rid Of</li>\n</ul>\n<p>These will keep me busy for a while, but as promised I will update here and always am looking for suggestions, especially if you know me, regarding anything you would like me to write about!</p>\n<p>Thank you for taking the time to read my initial post and I plan to share more soon!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=e7bf8459690b\" width=\"1\" height=\"1\">\n",
            "enclosure": {},
            "categories": [
                "personal-development",
                "storytelling",
                "health",
                "series",
                "life"
            ]
        },
        {
            "title": "Entrepreneurs sticking together — check out an awesome travel opportunity!",
            "pubDate": "2017-11-03 16:13:21",
            "link": "https://medium.com/startupiu/entrepreneurs-sticking-together-check-out-an-awesome-travel-opportunity-1d0234aa6ff7?source=rss-28ed505e83f3------2",
            "guid": "https://medium.com/p/1d0234aa6ff7",
            "author": "Tyler Citrin",
            "thumbnail": "https://cdn-images-1.medium.com/max/800/1*QV03X3pObT5xEPshvwFHxg.png",
            "description": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/1*QV03X3pObT5xEPshvwFHxg.png\"></figure><h3>Alumni Spotlight: Josh Gershon, founder of Startup Island</h3>\n<p>My name is Tyler Citrin and once upon a time I was an entrepreneur. I was never a fan of writing, but I thrive on conversation and have been extremely fortunate to speak with many different entrepreneurs about what they’re doing. I have a feeling this will become a trend along the way.</p>\n<p>I am excited to introduce you to an Indiana University alumnus and friend, Josh Gershon. Josh is the founder of <a href=\"https://www.joinstartupisland.com/\">Startup Island</a>, a “personal development accelerator, designed to connect entrepreneurial-minded students and young professionals, through a travel experience.”</p>\n<p>Check out below to hear his full story and if you’re interested, reach out to Josh at josh@joinstartupisland.com!</p>\n<p><strong>How did you come up with the idea?</strong></p>\n<p>I came up with the idea for <a href=\"http://joinstartupisland.com/\">Startup Island</a> in May of 2015, when I was at a crossroads in career. I had been with a food-tech startup for the last 18 months, and while I enjoyed the experience and the growth I was witnessing, I was starting to lack fulfillment in my day-to-day. So I gave myself two options, buy a one way ticket to Costa Rica and backpack for 6 months, or switch career paths and take an immersive course in graphic design.</p>\n<p>My heart wanted to travel because I knew deep down, that this would be a tremendous personal growth experience. My head was telling me to pursue career advancement in a more direct way. So I found myself grappling with the choice between personal development, or professional development. That was when I decided to create a program that would provide it’s participants with both. Personal growth through adventure and exploration, while surrounding yourself with mission-driven, innovative people with whom you can exchange ideas and resources to create a meaningful career path.</p>\n<p><strong>How’d you end up where you are today?</strong></p>\n<p>After I conceptualized the idea of this program I wanted to create, eventually I found myself in the process of building Startup Island. I had little experience and industry knowledge at the time, but I put together a website, Facebook group, Instagram page and just started telling people that we host travel experiences for entrepreneurs. There was a lot that was undefined at that point, until October 2015, when my co-founder (and one of my childhood best friends), Brian Helfman, came on board. He helped refine the vision into action, and we decided to focus our first few trips on college students, positioning ourselves as an alternative spring break for entrepreneurial students.</p>\n<p>We wound up getting our first trip off the ground in three months, and have been slowly but steadily picking up steam ever since. We’ve now hosted 7 trips for 107 travelers, 17 of whom have already come back two or three times. This year will be our third year doing spring break in Costa Rica.</p>\n<p><strong>What’d you do while in school?</strong></p>\n<p>I was an arts management major through SPEA, but to be quite honest, I didn’t get much out of the classroom. It was my own fault, but I really only cared about doing well enough to keep a mid-high 3.something GPA…other than that, I just wanted to have fun with my friends and watch the hoosiers play basketball.</p>\n<p>BUT, where I did learn a tremendous amount, and what I most attribute my passion for entrepreneurship to, was my time working for <a href=\"http://btownmenus.com/\">btownmenus.com</a>, during my four years at school. Mike Rolland (founder) became a mentor and good friend of mine, and I was fascinated watching Btownmenus grow into a massive success. I was also surprised that the work I was doing, was actually driving growth and engagement to the business. I realized then, that we as students can take action and build businesses…we didn’t have to wait until we got into “the real world.”</p>\n<p><strong>What classes or university resources helped the most?</strong></p>\n<p>Knowing what I know now, and based on how much entrepreneurship has grown on college campuses, I would have leveraged all and every resource I could find on campus, if I had the chance to do it again. For me back then, I just relied on my own guess and check methods, learned things by testing them at Btownmenus, and was well-guided by Mike and the rest of the leadership team as we built the company.</p>\n<p><strong>What did you learn at school and on the job?</strong></p>\n<p>Learn by doing was my key takeaway, but again, I would have done things differently if I could go back to school. As a student, it’s a rare time in your life, where it is your JOB to learn as much as possible. I’d advise any young entrepreneurs to seek out as much knowledge as possible — in the classroom, out of the classroom, by building relationships with your professors, etc. Don’t just study to pass the tests, learn the things you WANT to learn, and care about learning, because that is the stuff you’ll use to innovate.</p>\n<p><strong>Who inspired you along the way?</strong></p>\n<p>As a Hoosier, I’ve always been a big fan of Mark Cuban. But in my own life, as I mentioned, Mike was an early role-model. My uncle who is an entrepreneur has always been a role model.</p>\n<p>Outside of that, I always admired and was fascinated by digital nomads…people who left the corporate life (or never entered it to begin with) to pursue a life of location-independent work. It always just seemed as though they were living such more meaningful, and freedom-based lives.</p>\n<p><strong>Any advice to future entrepreneurs?</strong></p>\n<p>As I mentioned above, LEARN. If there is something you are interested in, even if it falls way outside your major, or is something that may seem completely irrelevant to your “career path,” if you’re interested in it…find a way to learn about it. Being interested makes you interesting.</p>\n<p>Try as many different jobs, classes, majors, various experiences as possible. Don’t assume that you are going to love the first thing you tell yourself you want to be <em>when you grow up.</em> Learn by trying, failing, and trying again.</p>\n<p>Surround yourselves with people who lift you up, challenge you, and inspire you.</p>\n<p>Do things that scare you. This is the hardest one, because nobody likes to be uncomfortable, but when you get through that discomfort and land on the other side, you will find immense growth.</p>\n<p>Thank you for taking the time to share your entrepreneurial journey with the StartupIU community, Josh!</p>\n<p><strong>About StartupIU</strong></p>\n<p>StartupIU is an initiative built and managed by the <a href=\"https://www.sice.indiana.edu/news/story.html?story=Shoemaker-Scholars-making-presence-felt-campus\">Shoemaker Scholars</a> that seeks to grow Indiana University’s community of changemakers, innovators, and entrepreneurs. If you want to stay in touch with upcoming events, news, and opportunities in the community, <a href=\"https://startupiu.soic.indiana.edu/\">become one of the over 1000 students on our email list.</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=1d0234aa6ff7\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.com/startupiu/entrepreneurs-sticking-together-check-out-an-awesome-travel-opportunity-1d0234aa6ff7\">Entrepreneurs sticking together — check out an awesome travel opportunity!</a> was originally published in <a href=\"https://medium.com/startupiu\">StartupIU</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
            "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/1*QV03X3pObT5xEPshvwFHxg.png\"></figure><h3>Alumni Spotlight: Josh Gershon, founder of Startup Island</h3>\n<p>My name is Tyler Citrin and once upon a time I was an entrepreneur. I was never a fan of writing, but I thrive on conversation and have been extremely fortunate to speak with many different entrepreneurs about what they’re doing. I have a feeling this will become a trend along the way.</p>\n<p>I am excited to introduce you to an Indiana University alumnus and friend, Josh Gershon. Josh is the founder of <a href=\"https://www.joinstartupisland.com/\">Startup Island</a>, a “personal development accelerator, designed to connect entrepreneurial-minded students and young professionals, through a travel experience.”</p>\n<p>Check out below to hear his full story and if you’re interested, reach out to Josh at josh@joinstartupisland.com!</p>\n<p><strong>How did you come up with the idea?</strong></p>\n<p>I came up with the idea for <a href=\"http://joinstartupisland.com/\">Startup Island</a> in May of 2015, when I was at a crossroads in career. I had been with a food-tech startup for the last 18 months, and while I enjoyed the experience and the growth I was witnessing, I was starting to lack fulfillment in my day-to-day. So I gave myself two options, buy a one way ticket to Costa Rica and backpack for 6 months, or switch career paths and take an immersive course in graphic design.</p>\n<p>My heart wanted to travel because I knew deep down, that this would be a tremendous personal growth experience. My head was telling me to pursue career advancement in a more direct way. So I found myself grappling with the choice between personal development, or professional development. That was when I decided to create a program that would provide it’s participants with both. Personal growth through adventure and exploration, while surrounding yourself with mission-driven, innovative people with whom you can exchange ideas and resources to create a meaningful career path.</p>\n<p><strong>How’d you end up where you are today?</strong></p>\n<p>After I conceptualized the idea of this program I wanted to create, eventually I found myself in the process of building Startup Island. I had little experience and industry knowledge at the time, but I put together a website, Facebook group, Instagram page and just started telling people that we host travel experiences for entrepreneurs. There was a lot that was undefined at that point, until October 2015, when my co-founder (and one of my childhood best friends), Brian Helfman, came on board. He helped refine the vision into action, and we decided to focus our first few trips on college students, positioning ourselves as an alternative spring break for entrepreneurial students.</p>\n<p>We wound up getting our first trip off the ground in three months, and have been slowly but steadily picking up steam ever since. We’ve now hosted 7 trips for 107 travelers, 17 of whom have already come back two or three times. This year will be our third year doing spring break in Costa Rica.</p>\n<p><strong>What’d you do while in school?</strong></p>\n<p>I was an arts management major through SPEA, but to be quite honest, I didn’t get much out of the classroom. It was my own fault, but I really only cared about doing well enough to keep a mid-high 3.something GPA…other than that, I just wanted to have fun with my friends and watch the hoosiers play basketball.</p>\n<p>BUT, where I did learn a tremendous amount, and what I most attribute my passion for entrepreneurship to, was my time working for <a href=\"http://btownmenus.com/\">btownmenus.com</a>, during my four years at school. Mike Rolland (founder) became a mentor and good friend of mine, and I was fascinated watching Btownmenus grow into a massive success. I was also surprised that the work I was doing, was actually driving growth and engagement to the business. I realized then, that we as students can take action and build businesses…we didn’t have to wait until we got into “the real world.”</p>\n<p><strong>What classes or university resources helped the most?</strong></p>\n<p>Knowing what I know now, and based on how much entrepreneurship has grown on college campuses, I would have leveraged all and every resource I could find on campus, if I had the chance to do it again. For me back then, I just relied on my own guess and check methods, learned things by testing them at Btownmenus, and was well-guided by Mike and the rest of the leadership team as we built the company.</p>\n<p><strong>What did you learn at school and on the job?</strong></p>\n<p>Learn by doing was my key takeaway, but again, I would have done things differently if I could go back to school. As a student, it’s a rare time in your life, where it is your JOB to learn as much as possible. I’d advise any young entrepreneurs to seek out as much knowledge as possible — in the classroom, out of the classroom, by building relationships with your professors, etc. Don’t just study to pass the tests, learn the things you WANT to learn, and care about learning, because that is the stuff you’ll use to innovate.</p>\n<p><strong>Who inspired you along the way?</strong></p>\n<p>As a Hoosier, I’ve always been a big fan of Mark Cuban. But in my own life, as I mentioned, Mike was an early role-model. My uncle who is an entrepreneur has always been a role model.</p>\n<p>Outside of that, I always admired and was fascinated by digital nomads…people who left the corporate life (or never entered it to begin with) to pursue a life of location-independent work. It always just seemed as though they were living such more meaningful, and freedom-based lives.</p>\n<p><strong>Any advice to future entrepreneurs?</strong></p>\n<p>As I mentioned above, LEARN. If there is something you are interested in, even if it falls way outside your major, or is something that may seem completely irrelevant to your “career path,” if you’re interested in it…find a way to learn about it. Being interested makes you interesting.</p>\n<p>Try as many different jobs, classes, majors, various experiences as possible. Don’t assume that you are going to love the first thing you tell yourself you want to be <em>when you grow up.</em> Learn by trying, failing, and trying again.</p>\n<p>Surround yourselves with people who lift you up, challenge you, and inspire you.</p>\n<p>Do things that scare you. This is the hardest one, because nobody likes to be uncomfortable, but when you get through that discomfort and land on the other side, you will find immense growth.</p>\n<p>Thank you for taking the time to share your entrepreneurial journey with the StartupIU community, Josh!</p>\n<p><strong>About StartupIU</strong></p>\n<p>StartupIU is an initiative built and managed by the <a href=\"https://www.sice.indiana.edu/news/story.html?story=Shoemaker-Scholars-making-presence-felt-campus\">Shoemaker Scholars</a> that seeks to grow Indiana University’s community of changemakers, innovators, and entrepreneurs. If you want to stay in touch with upcoming events, news, and opportunities in the community, <a href=\"https://startupiu.soic.indiana.edu/\">become one of the over 1000 students on our email list.</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=1d0234aa6ff7\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.com/startupiu/entrepreneurs-sticking-together-check-out-an-awesome-travel-opportunity-1d0234aa6ff7\">Entrepreneurs sticking together — check out an awesome travel opportunity!</a> was originally published in <a href=\"https://medium.com/startupiu\">StartupIU</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
            "enclosure": {},
            "categories": [
                "startup",
                "travel",
                "entrepreneurship",
                "professional-development"
            ]
        }
    ]
}